[
  {
    "model": "catalogue.products",
    "pk": 1,
    "fields": {
      "name": "Книга 1",
      "slug": "kniga-1",
      "author": "Автор 1",
      "publisher": "Издатель 1",
      "isbn": null,
      "year": 2021,
      "number_of_pages": 111,
      "description": "Описание 1",
      "price": "100.00",
      "quantity": 5,
      "book_theme": "frontend",
      "programming_language": "JavaScript",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 1
    }
  },
  {
    "model": "catalogue.products",
    "pk": 2,
    "fields": {
      "name": "кн 2",
      "slug": "kn-2",
      "author": "ав 2",
      "publisher": "и 2",
      "isbn": null,
      "year": 2022,
      "number_of_pages": 22,
      "description": "о 2",
      "price": "232.00",
      "quantity": 15,
      "book_theme": "gamedev",
      "programming_language": "SQL",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 1
    }
  },
  {
    "model": "catalogue.products",
    "pk": 3,
    "fields": {
      "name": "book 3",
      "slug": "book-3",
      "author": "a3",
      "publisher": "e3",
      "isbn": "sdasdsa",
      "year": 2000,
      "number_of_pages": 22,
      "description": "desc 3",
      "price": "323.00",
      "quantity": 23,
      "book_theme": "devops",
      "programming_language": "OT",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 3
    }
  },
  {
    "model": "catalogue.products",
    "pk": 4,
    "fields": {
      "name": "Создание веб-API Python с помощью FastAPI",
      "slug": "sozdanie-veb-api-python-s-pomoshyu-fastapi",
      "author": "Абдулазиз Абдулазиз Адешина",
      "publisher": "Packt",
      "isbn": "978-1-80107-663-0",
      "year": 2022,
      "number_of_pages": 210,
      "description": "Быстрое руководство по созданию высокопроизводительных и надежных веб-API с очень небольшим количеством шаблонного кода.",
      "price": "1200.00",
      "quantity": 10,
      "book_theme": "backend",
      "programming_language": "Python",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 4
    }
  },
  {
    "model": "catalogue.products",
    "pk": 5,
    "fields": {
      "name": "От «Энигмы» до ChatGPT",
      "slug": "ot-enigmy-do-chatgpt",
      "author": "Рустам Агамалиев",
      "publisher": "Миф",
      "isbn": "978-5-00214-351-1",
      "year": 2024,
      "number_of_pages": 208,
      "description": "В этой книге вы найдете различные способы использования chatGPT в российской практике: от языкового перевода, написания, редактирования и резюмирования текстов до анализа данных и генерации идей. Благодаря автоматизации рутинных рабочих процессов вы наконец сможете сосредоточиться на том, что действительно важно и интересно, а ваша профессиональная эффективность повысится.",
      "price": "399.00",
      "quantity": 20,
      "book_theme": "ai",
      "programming_language": "OT",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 1
    }
  },
  {
    "model": "catalogue.products",
    "pk": 6,
    "fields": {
      "name": "Отзывчивый дизайн на HTML5 и CSS3 для любых устройств",
      "slug": "otzyvchivyj-dizajn-na-html5-i-css3-dlya-lyubyh-ustrojstv",
      "author": "Бен Фрэйн",
      "publisher": "Packt",
      "isbn": "978-5-4461-1495-5",
      "year": 2022,
      "number_of_pages": 336,
      "description": "Вы фуллстек-разработчик, которому нужно развивать навыки фронтенд-разработки? Или фронтенд-разработчик, ищущий качественный обзор современных возможностей HTML и CSS? А может, вы создаете свой веб-сайт и хотите сделать его отзывчивым? Тогда, эта книга вам просто необходима! Со времени выхода предыдущего издания многое изменилось, теперь отзывчивый дизайн — это не новая технология, а стандарт разработки на HTML5 и CSS3. Неформальный и открытый стиль автора позволяет быстро освоить все возможности современного веб-дизайна. Вы получите практические знания о SVG, разметке HTML, создании потрясающей эстетики и эффектов с помощью CSS, переходах, преобразованиях и анимациях и многом другом. Если же вы опытный веб-игрок, то смело переходите к новым темам — гридам (CSS Grid layout) или вариативным шрифтам.",
      "price": "545.00",
      "quantity": 5,
      "book_theme": "frontend",
      "programming_language": "OT",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 5
    }
  },
  {
    "model": "catalogue.products",
    "pk": 7,
    "fields": {
      "name": "Творческий отбор. Как создавались лучшие продукты Apple во времена Стива Джобса",
      "slug": "tvorcheskij-otbor-kak-sozdavalis-luchshie-produkty-apple-vo-vremena-stiva-dzhobsa",
      "author": "Кен Косиенда",
      "publisher": "Бомбора",
      "isbn": "978-5-04-104646-0",
      "year": 2020,
      "number_of_pages": 360,
      "description": "Сотни миллионов людей ежедневно пользуются продукцией Apple. Несколько тысяч специалистов работают в калифорнийском офисе компании. Но лишь небольшая группа людей была у истоков создания знаменитого программного обеспечения Apple. Кен Косиенда — главный инженер программного обеспечения iPhone, работавший в «золотой век» компании вместе со Стивом Джобсом. Если в продукции Apple и есть какая-то присущая только ей магия, то это ее ПО, и Кен Косиенда расскажет, как создавались самые важные программные продукты в истории компании.",
      "price": "622.00",
      "quantity": 32,
      "book_theme": "OT",
      "programming_language": "OT",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 1
    }
  },
  {
    "model": "catalogue.products",
    "pk": 8,
    "fields": {
      "name": "Создаем динамические веб-сайты с помощью PHP, MySQL, javascript, CSS и HTML5",
      "slug": "sozdaem-dinamicheskie-veb-sajty-s-pomoshyu-php-mysql-javascript-css-i-html5",
      "author": "Робин Никсон",
      "publisher": "O'Reilly",
      "isbn": "978-5-496-02146-3",
      "year": 2023,
      "number_of_pages": 766,
      "description": "Новое издание бестселлера описывает как клиентские, так и серверные аспекты веб-разработки. Книга, наполненная ценными практическими советами и подробным теоретическим материалом, поможет вам освоить динамическое веб-программирование с применением самых современных технологий. Для закрепления усвоенных знаний автор расскажет, как создать иоднофункциональный сайт, работающий по принципу социальной сети. При написании данной книги автор предполагал, что читатель уже имеет элементарные понятия об HTML и способен как минимум скомпоновать простой статический сайт.",
      "price": "1399.00",
      "quantity": 15,
      "book_theme": "frontend",
      "programming_language": "JavaScript",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 2
    }
  },
  {
    "model": "catalogue.products",
    "pk": 9,
    "fields": {
      "name": "Общество контроля. Как сохранить конфиденциальность в эпоху тотальной слежки",
      "slug": "obshestvo-kontrolya-kak-sohranit-konfidencialnost-v-epohu-totalnoj-slezhki",
      "author": "Джон Фасман",
      "publisher": "Бомбора",
      "isbn": "978-5-04-174709-1",
      "year": 2023,
      "number_of_pages": 368,
      "description": "«Общество контроля» – масштабное исследование Джона Фасмана, вашингтонского корреспондента журнала The Economist. Оно посвящено правовым, политическим и моральным проблемам, неизбежно возникающим в обществе, где каждый из нас постоянно находится под наблюдением. Технологии распознавания лиц, автоматические считыватели автомобильных номеров, летающие дроны, алгоритмы прогнозирования поведения – все это попадает в фокус внимания автора, заставляя его задуматься о том, кому может быть выгодно массовое использование технологий слежки и как оно влияет на нашу жизнь.",
      "price": "250.00",
      "quantity": 20,
      "book_theme": "OT",
      "programming_language": "OT",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 1
    }
  },
  {
    "model": "catalogue.products",
    "pk": 10,
    "fields": {
      "name": "Создаем динамические веб-сайты на PHP",
      "slug": "sozdaem-dinamicheskie-veb-sajty-na-php",
      "author": "Кевин Татро, Питер Макинтайр",
      "publisher": "O'Reilly",
      "isbn": "978-5-4461-1488-7",
      "year": 2021,
      "number_of_pages": 832,
      "description": "Сложно найти что-то толковое про PHP? Проверенная временем, обновленная в четвертом издании, эта книга помогает начинающим разработчикам научиться всему, что необходимо для создания качественных веб-приложений. Вы начнете с общего описания технологии и постепенно перейдете к синтаксису языка, приемам программирования и другим важным деталям. При этом будут использоваться примеры, демонстрирующие и правильное применение языка, и распространенные идиомы. Предполагается, что читатель уже имеет опыт работы с HTML. Вы получите множество рекомендаций по стилю программирования и процессу разработки ПО от Кевина Татро и Питера Макинтайра.",
      "price": "565.00",
      "quantity": 0,
      "book_theme": "frontend",
      "programming_language": "OT",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 1
    }
  },
  {
    "model": "catalogue.products",
    "pk": 11,
    "fields": {
      "name": "Атака сетей на уровне протоколов",
      "slug": "ataka-setej-na-urovne-protokolov",
      "author": "Джеймс Форшоу",
      "publisher": "ДМК-Пресс",
      "isbn": "978-5-97060-972-9",
      "year": 2021,
      "number_of_pages": 340,
      "description": "Эта книга посвящена безопасности сетевых протоколов. Джеймс Форшоу, известный во всем мире специалист по поиску программных ошибок, рассматривает сеть с точки зрения злоумышленника, чтобы помочь вам обнаружить уязвимости и защититься от них. Вы узнаете, как можно перехватить трафик, освоите статический и динамический анализ сетевых протоколов, рассмотрите их структуры и методы шифрования. Изучив основы, вы сосредоточитесь на поиске и эксплуатации уязвимостей с учетом общих классов ошибок, фаззинга, отладки и различных типов атак (нарушение целостности памяти, обход аутентификации, отказ в обслуживании и др.).",
      "price": "1674.00",
      "quantity": 18,
      "book_theme": "CS",
      "programming_language": "OT",
      "book_bindings": "Твердый переплет",
      "translator_choice": "Имя переводчика",
      "level": 1
    }
  },
  {
    "model": "catalogue.products",
    "pk": 12,
    "fields": {
      "name": "Икона DOOM. Жизнь от первого лица. Автобиография",
      "slug": "ikona-doom-zhizn-ot-pervogo-lica-avtobiografiya",
      "author": "Джон Ромеро",
      "publisher": "Бомбора",
      "isbn": "978-5-04-191289-5",
      "year": 2024,
      "number_of_pages": 624,
      "description": "Перед вами автобиография легендарного разработчика Джона Ромеро – увлекательное погружение в мир игровой индустрии!\r\nЭта книга раскроет тайны и подробности создания таких знаковых игр, как DOOM, Wolfenstein 3D и Quake, и поможет понять, почему эти игры отзываются в сердцах миллионов людей.\r\nОднако вы не только узнаете больше о любимых играх, но и познакомитесь с личностью самого Джона Ромеро – гейм-дизайнера и инноватора.",
      "price": "329.00",
      "quantity": 4,
      "book_theme": "gamedev",
      "programming_language": "OT",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 1
    }
  },
  {
    "model": "catalogue.products",
    "pk": 13,
    "fields": {
      "name": "Социальная инженерия и этичный хакинг на практике",
      "slug": "socialnaya-inzheneriya-i-etichnyj-haking-na-praktike",
      "author": "Джо Грей",
      "publisher": "ДМК-Пресс",
      "isbn": "978-5-9706-0980-4",
      "year": 2023,
      "number_of_pages": 226,
      "description": "Джо Грей, отмеченный наградами эксперт в области социальной инженерии, делится примерами из практики, передовым опытом, инструментами аналитики с открытым исходным кодом (OSINT), заготовками для организации атак и шаблонами отчетов, чтобы компании могли лучше защитить себя. Он описывает творческие методы, позволяющие обманным путем выманить у пользователей их учетные данные: использование сценариев Python и редактирование файлов HTML для клонирования легального веб-сайта. Научившись собирать информацию о ваших жертвах с помощью передовых методов OSINT, вы узнаете, как защитить свою организацию от подобных угроз.",
      "price": "435.00",
      "quantity": 6,
      "book_theme": "CS",
      "programming_language": "Python",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 3
    }
  },
  {
    "model": "catalogue.products",
    "pk": 14,
    "fields": {
      "name": "Антология машинного обучения. Важнейшие исследования в области ИИ за последние 60 лет",
      "slug": "antologiya-mashinnogo-obucheniya-vazhnejshie-issledovaniya-v-oblasti-ii-za-poslednie-60-let",
      "author": "Терренс Дж. Сейновски",
      "publisher": "Бомбора",
      "isbn": "978-5-04-101347-9",
      "year": 2022,
      "number_of_pages": 304,
      "description": "Масштабный труд одного из ведущих мировых ученых в области исследования искусственного интеллекта Терренса Сейновски проведет читателя по всем ключевым вехам в развитии этой технологии. Работа Сейновски охватывает промежуток в 60 лет, за которые машинное обучение шагнуло из теоретических исследований в прикладную науку.\r\nЯвляясь ученым-нейробиологом и заведующим лабораторией Вычислительной нейробиологии в Институте Солка (США), а также профессором в Калифорнийском Университете в Сан-Диего, автор начинал исследования нейросетей еще в 80-е годы, до «революции» глубокого обучения, выдвинувшей искусственный интеллект в ранг самых перспективных технологий современности.",
      "price": "799.00",
      "quantity": 5,
      "book_theme": "ai",
      "programming_language": "OT",
      "book_bindings": "Твердый переплет",
      "translator_choice": "Отсутствует",
      "level": 1
    }
  },
  {
    "model": "catalogue.products",
    "pk": 15,
    "fields": {
      "name": "Практический хакинг интернета вещей",
      "slug": "prakticheskij-haking-interneta-veshej",
      "author": "Фотиос Чанцис, Иоаннис Стаис и др.",
      "publisher": "ДМК-Пресс",
      "isbn": "978-5-97060-974-3",
      "year": 2022,
      "number_of_pages": 480,
      "description": "Устройств, управляемых через интернет, с каждым годом становится больше, но не все грамотно оценивают сопутствующие риски. Из этой книги читатель узнает, каким образом подключать умную технику у себя дома и на предприятиях, чтобы наилучшим образом себя обезопасить. Авторы подробно описывают уязвимости в сфере интернета вещей (IoT), моделируют угрозы и представляют эффективную методологию тестирования умных устройств – от инфузионной помпы до беговой дорожки. Практические упражнения научат вовремя распознавать угрозы и предотвращать атаки злоумышленников.",
      "price": "2010.00",
      "quantity": 2,
      "book_theme": "CS",
      "programming_language": "OT",
      "book_bindings": "Твердый переплет",
      "translator_choice": "Имя переводчика",
      "level": 2
    }
  },
  {
    "model": "catalogue.products",
    "pk": 16,
    "fields": {
      "name": "Вычислительная машина и мозг",
      "slug": "vychislitelnaya-mashina-i-mozg",
      "author": "Джон фон Нейман",
      "publisher": "ACT",
      "isbn": "978-5-17-111540-1",
      "year": 2018,
      "number_of_pages": 192,
      "description": "Информационные технологии кардинально изменили жизнь человека, затронув каждую ее сторону – от бизнеса и науки до политики и искусства. Искусственный интеллект перестал быть фантастикой и сделался реальностью. И именно эта всесторонняя компьютеризация общества поставила перед нами новый фундаментальный вопрос: какова разница между интеллектом искусственным и интеллектом человеческим и есть ли она вообще? Джон фон Нейман в своей поистине пророческой, выдержавшей испытание временем и до сих пор регулярно переиздающейся книге утверждает: такая разница минимальна. Несмотря на все различия в архитектуре и строительных блоках мозга и вычислительной машины, искусственный интеллект тем не менее способен имитировать работу мозга.",
      "price": "219.00",
      "quantity": 0,
      "book_theme": "OT",
      "programming_language": "OT",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 1
    }
  },
  {
    "model": "catalogue.products",
    "pk": 17,
    "fields": {
      "name": "Этичный хакинг. Практическое руководство по взлому",
      "slug": "etichnyj-haking-prakticheskoe-rukovodstvo-po-vzlomu",
      "author": "Дэниел Г. Грэм",
      "publisher": "Питер",
      "isbn": "978-5-4461-1952-3",
      "year": 2022,
      "number_of_pages": 384,
      "description": "Практическое руководство по взлому компьютерных систем с нуля, от перехвата трафика до создания троянов. Книга «Этичный хакинг» освещает современные проблемы кибербезопасности и помогает освоить навыки, необходимые любому этичному хакеру. Сделайте первый шаг в карьере пентестера, ознакомившись с методами взлома, которые используют эксперты.",
      "price": "670.00",
      "quantity": 1,
      "book_theme": "CS",
      "programming_language": "OT",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 1
    }
  },
  {
    "model": "catalogue.products",
    "pk": 18,
    "fields": {
      "name": "Эффективная работа в Microsoft Excel",
      "slug": "effektivnaya-rabota-v-microsoft-excel",
      "author": "Алан Мюррей",
      "publisher": "ДМК-Пресс",
      "isbn": "978-5-97060-922-4",
      "year": 2021,
      "number_of_pages": 276,
      "description": "Книга знакомит читателей с углубленными техниками использования Microsoft Excel, которые расширяют возможности работы в этой программе и автоматизируют многие рутинные процессы. Microsoft Excel широко применяется в офисной работе для ведения учета и анализа данных, но большинство пользователей осваивает лишь базовые навыки этого программного продукта. Алан Мюррей, преподаватель и консультант по Excel, открывает ряд секретов, которые выведут работу с программой на новый уровень. Вы узнаете о многих полезных функциях, глубоко погрузитесь в мир формул, изучите техники форматирования, улучшающие представление данных.",
      "price": "499.00",
      "quantity": 3,
      "book_theme": "OT",
      "programming_language": "OT",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 3
    }
  },
  {
    "model": "catalogue.products",
    "pk": 19,
    "fields": {
      "name": "Архитектура видеоигровых миров. Уровень пройден!",
      "slug": "arhitektura-videoigrovyh-mirov-uroven-projden",
      "author": "Мария Важенич, Артемий Козлов, Иероним К.",
      "publisher": "ACT",
      "isbn": "978-5-17-157166-5",
      "year": 2023,
      "number_of_pages": 384,
      "description": "Почему видеоигровые миры увлекают на долгие часы? Какие элементы дизайна могут рассказать об устройстве мира больше, чем сюжет игры? Что общего у Cyberpunk 2077 и Dragon Age II?\r\nВ книге «Архитектура видеоигровых миров» авторы изучат эти вопросы сквозь призму архитектуры: как она влияет на разработку игр, почему в одних мирах нам хочется задержаться подольше, а другие поскорее покинуть. Архитектор Мария Важенич в соавторстве с разработчиком Артемием Козловым и исследователем Иеронимом К. помогут разобраться в том, почему архитектура настолько важна для видеоигр. Книга будет интересна как архитекторам и геймерам, которые хотят узнать о видеоиграх больше, так и разработчикам и дизайнерам, ищущим новые инструменты и приемы.",
      "price": "329.00",
      "quantity": 4,
      "book_theme": "gamedev",
      "programming_language": "OT",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 1
    }
  },
  {
    "model": "catalogue.products",
    "pk": 20,
    "fields": {
      "name": "Безопасность веб-приложений на Python",
      "slug": "bezopasnost-veb-prilozhenij-na-python",
      "author": "Деннис Бирн",
      "publisher": "ДМК-Пресс",
      "isbn": "978-5-97060-899-9",
      "year": 2023,
      "number_of_pages": 334,
      "description": "В этой книге подробно рассказывается о нюансах написания безопасного кода на Python. В первой части излагаются основы криптографии: рассмотрены базовые понятия, проверка подлинности данных, симметричное и асимметричное шифрование. Вторая часть содержит пошаговые инструкции для воплощения типичных сценариев взаимодействия пользователя с приложением. В третьей части показано, как противостоять атакам разного рода. Все примеры кода воспроизводят реальные задачи, стоящие перед разработчиками.",
      "price": "999.00",
      "quantity": 10,
      "book_theme": "CS",
      "programming_language": "Python",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 4
    }
  },
  {
    "model": "catalogue.products",
    "pk": 21,
    "fields": {
      "name": "Алгоритмы Data Science и их практическая реализация на Python",
      "slug": "algoritmy-data-science-i-ih-prakticheskaya-realizaciya-na-python",
      "author": "Протодьяконов Андрей Владимирович, Пылов Петр Андреевич, Садовников Владимир Евгениевич",
      "publisher": "Инфра-Инженерия",
      "isbn": "978-5-9729-1006-9",
      "year": 2022,
      "number_of_pages": 392,
      "description": "Рассмотрен полный каскад разработки моделей искусственного интеллекта. Проанализирована область Data Science, из которой выделены все необходимые для прикладной сферы алгоритмы машинного обучения, расположенные по уровню возрастания сложности работы с ними.\r\nДля студентов, изучающих информационные технологии. Может быть полезно как начинающим программистам, так и специалистам высокого уровня.",
      "price": "499.00",
      "quantity": 2,
      "book_theme": "data",
      "programming_language": "Python",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 3
    }
  },
  {
    "model": "catalogue.products",
    "pk": 22,
    "fields": {
      "name": "Читаем Тьюринга. Путешествие по исторической статье Тьюринга о вычислимости и машинах Тьюринга",
      "slug": "chitaem-tyuringa-puteshestvie-po-istoricheskoj-state-tyuringa-o-vychislimosti-i-mashinah-tyuringa",
      "author": "Чарльз Петцольд",
      "publisher": "ДМК-Пресс",
      "isbn": "978-5-97060-010-8",
      "year": 2014,
      "number_of_pages": 440,
      "description": "Книга принадлежит перу известного американского популяризатора Чарлза Петцольда. В ней автор исследует главную работу Алана Тьюринга, посвященную проблеме разрешимости. Именно в этой работе впервые появились знаменитые машины Тьюринга, ставшие на многие годы универсальной теоретической концепцией computer science. Автор тонко и деликатно проведет вас по самым потаенным уголкам, из которых родились на свет современные компьютеры и современное программное обеспечение.",
      "price": "889.00",
      "quantity": 7,
      "book_theme": "OT",
      "programming_language": "OT",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 1
    }
  },
  {
    "model": "catalogue.products",
    "pk": 23,
    "fields": {
      "name": "Безопасность веб-приложений. Исчерпывающий гид для начинающих разработчиков",
      "slug": "bezopasnost-veb-prilozhenij-ischerpyvayushij-gid-dlya-nachinayushih-razrabotchikov",
      "author": "Таня Янка",
      "publisher": "Бомбора",
      "isbn": "978-5-04-171803-9",
      "year": 2023,
      "number_of_pages": 464,
      "description": "Поддерживать безопасность своих продуктов — одна из первостепенных задач любой современной IT-компании. В этой книге вы найдете пошаговые инструкции по тому, как спроектировать безопасную архитектуру веб-сайтов и приложений и защищать ее на всех этапах производства и реализации. Более того, автор даст ответы на самые распространенные вопросы об информационной безопасности и расскажет о лучших практиках гигантов технологической индустрии, например, Microsoft и Google.",
      "price": "765.00",
      "quantity": 20,
      "book_theme": "frontend",
      "programming_language": "OT",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 3
    }
  },
  {
    "model": "catalogue.products",
    "pk": 24,
    "fields": {
      "name": "Защита данных. От авторизации до аудита",
      "slug": "zashita-dannyh-ot-avtorizacii-do-audita",
      "author": "Джейсон Андресс",
      "publisher": "Питер",
      "isbn": "978-5-44-611733-8",
      "year": 2021,
      "number_of_pages": 272,
      "description": "Чем авторизация отличается от аутентификации? Как сохранить конфиденциальность и провести тестирование на проникновение? Автор отвечает на все базовые вопросы и на примерах реальных инцидентов рассматривает операционную безопасность, защиту ОС и мобильных устройств, а также проблемы проектирования сетей. Книга подойдет для новичков в области информационной безопасности, сетевых администраторов и всех интересующихся. Она станет отправной точкой для карьеры в области защиты данных.",
      "price": "314.00",
      "quantity": 1,
      "book_theme": "CS",
      "programming_language": "OT",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 1
    }
  },
  {
    "model": "catalogue.products",
    "pk": 25,
    "fields": {
      "name": "Криптография с секретным ключом",
      "slug": "kriptografiya-s-sekretnym-klyuchom",
      "author": "Фрэнк Рубин",
      "publisher": "ДМК-Пресс",
      "isbn": "978-5-97060-748-0",
      "year": 2023,
      "number_of_pages": 386,
      "description": "В книге объясняется, как создавать шифры с секретным ключом – от\r\nпростых, для которых хватает карандаша и бумаги, до очень сложных, применяемых в современной компьютерной криптографии. Вы научитесь конструировать 30 невскрываемых шифров, измерять стойкость шифров и гарантированно обеспечивать их безопасность, противостоять гипотетическим ультракомпьютерам будущего. А для развлечения предлагается вскрыть несколько несложных мини шифров.",
      "price": "415.00",
      "quantity": 3,
      "book_theme": "CS",
      "programming_language": "OT",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 2
    }
  },
  {
    "model": "catalogue.products",
    "pk": 26,
    "fields": {
      "name": "60+ проектов на Raspberry Pi Pico W",
      "slug": "60-proektov-na-raspberry-pi-pico-w",
      "author": "Доган Ибрагим",
      "publisher": "Elektor Publication",
      "isbn": "978-3-89576-529-2",
      "year": 2022,
      "number_of_pages": 308,
      "description": "Эта книга представляет собой введение в использование платы разработки микроконтроллера Raspberry Pi Pico W с языком программирования MicroPython. Среда разработки Thonny (IDE) используется во всех проектах книги, и читателям рекомендуется использовать эту IDE. В книге есть много рабочих и протестированных проектов, охватывающих почти все аспекты Raspberry Pi Pico W. За исключением тем, связанных с Wi-Fi, все проекты в книге также можно использовать со стандартным Raspberry Pi Pico без каких-либо модификаций.",
      "price": "437.00",
      "quantity": 4,
      "book_theme": "OT",
      "programming_language": "OT",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 1
    }
  },
  {
    "model": "catalogue.products",
    "pk": 27,
    "fields": {
      "name": "Информатика. Разработка программ на языке программирования Питон",
      "slug": "informatika-razrabotka-programm-na-yazyke-programmirovaniya-piton",
      "author": "А. И. Широков, М.О. Пышняк",
      "publisher": "МИСиС",
      "isbn": "978-5-907226-76-0",
      "year": 2020,
      "number_of_pages": 142,
      "description": "В учебнике рассматриваются основные конструкции языка программирования Питон (Python). Приводятся многочисленные примеры, которые позволят современному специалисту овладеть навыками для создания приложений разной направленности.",
      "price": "202.00",
      "quantity": 4,
      "book_theme": "backend",
      "programming_language": "Python",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 1
    }
  },
  {
    "model": "catalogue.products",
    "pk": 28,
    "fields": {
      "name": "Рефакторинг. Улучшение проекта существующего кода",
      "slug": "refaktoring-uluchshenie-proekta-sushestvuyushego-koda",
      "author": "Мартин Фаулер, Кент Бек и Джон Брант",
      "publisher": "Диалектика",
      "isbn": "978-5-9909445-1-0",
      "year": 2019,
      "number_of_pages": 448,
      "description": "Авторы показывают читателям, как исправить и оптимизировать сомнительный или откровенно неудачный проект. Рефакторинг кода по Фаулеру — это совокупность дискретных изменений кода, дающих в конечном счете накопительный эффект. Эта тонкая работа позволяет предотвратить, казалось бы, неизбежный распад проблемного приложения.\r\n\r\nПроцесс «реанимации» кодов проиллюстрирован семью десятками примеров на языке Java. Принципы Фаулера применимы к кодам на любом языке ООП, что делает издание особенно ценным.",
      "price": "423.00",
      "quantity": 5,
      "book_theme": "backend",
      "programming_language": "Java",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 3
    }
  },
  {
    "model": "catalogue.products",
    "pk": 29,
    "fields": {
      "name": "Паттерны проектирования API",
      "slug": "patterny-proektirovaniya-api",
      "author": "Гивакс Дж.Дж.",
      "publisher": "Питер",
      "isbn": "978-5-4461-1984-4",
      "year": 2024,
      "number_of_pages": 512,
      "description": "API представляют собой контракты, которые определяют принципы взаимодействия приложений, сервисов и компонентов. Паттерны проектирования API — это набор лучших практик, спецификаций и стандартов, обеспечивающих простоту и надежность их использования для разработчиков. Книга объединяет и объясняет наиболее важные паттерны, используемые сообществом разработчиков API и экспертами Google. Паттерны проектирования API определяют набор принципов для разработки внутренних и публичных API. Джей Джей Гивакс, будучи специалистом из Google, рассказывает о паттернах, которые обеспечат вашим API согласованность, масштабируемость и гибкость. Вы узнаете, как улучшить дизайн самых распространенных API и как действовать в сложных пограничных случаях. Понятные иллюстрации, актуальные примеры и подробные сценарии позволят тщательно разобраться в каждом паттерне.",
      "price": "321.00",
      "quantity": 2,
      "book_theme": "backend",
      "programming_language": "OT",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 4
    }
  },
  {
    "model": "catalogue.products",
    "pk": 30,
    "fields": {
      "name": "Бизнес-моделирование и анализ данных. Решение актуальных задач с помощью Microsoft Excel",
      "slug": "biznes-modelirovanie-i-analiz-dannyh-reshenie-aktualnyh-zadach-s-pomoshyu-microsoft-excel",
      "author": "Уэйн Винстон",
      "publisher": "Питер",
      "isbn": "978-5-4461-1339-2",
      "year": 2021,
      "number_of_pages": 864,
      "description": "Уэйн Винстон научит вас быстро анализировать данные, принимать решения, подводить итоги, составлять отчеты, обрабатывать данные и строить аналитические модели в Microsoft Excel 2019 и Ofﬁce 365. В новом шестом издании вас ждут более 800 бизнес-задач, основанных на реальных ситуациях, а также обсуждение новых инструментов и функций.",
      "price": "405.00",
      "quantity": 3,
      "book_theme": "data",
      "programming_language": "OT",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 2
    }
  },
  {
    "model": "catalogue.products",
    "pk": 31,
    "fields": {
      "name": "Грокаем стриминг",
      "slug": "grokaem-striming",
      "author": "Джош Фишер, Нин Ван",
      "publisher": "Питер",
      "isbn": "978-5-4461-2306-3",
      "year": 2023,
      "number_of_pages": 288,
      "description": "Вы можете познакомиться с созданием стриминговых приложений и обработкой событий в реальном времени не продираясь через технические подробности конкретных фреймворков, головоломные термины и сложные формулировки. Простой язык и яркие примеры позволят вам познакомиться с базовыми концепциями, а чтобы усвоить описанные идеи и приемы, вы построите собственную простую стриминговую программу с нуля. От читателя не требуется опыт работы со стриминговыми системами. Примеры написаны на языке Java.",
      "price": "249.00",
      "quantity": 2,
      "book_theme": "backend",
      "programming_language": "Java",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 5
    }
  },
  {
    "model": "catalogue.products",
    "pk": 32,
    "fields": {
      "name": "C++ для начинающих",
      "slug": "c-dlya-nachinayushih",
      "author": "Герберт Шилдт",
      "publisher": "Питер",
      "isbn": "978-5-4461-1821-2",
      "year": 2024,
      "number_of_pages": 608,
      "description": "Книга известного американского специалиста и популяризатора языков программирования посвящена основам языка C++. Начиная с таких базовых понятий языка, как типы данных, массивы, строки, указатели и функции, книга охватывает также важнейшие элементы объектно-ориентированного программирования - классы и объекты, наследование, виртуальные функции, потоки ввода/вывода, исключения и шаблоны. Каждый раздел сопровождается простыми и наглядными примерами, позволяющими получить практические навыки программирования.\r\nКнига предназначена для приступающих к изучению языка C++, одного из самых универсальных и распространенных на сегодня языков программирования.",
      "price": "499.00",
      "quantity": 1,
      "book_theme": "backend",
      "programming_language": "C++",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 1
    }
  },
  {
    "model": "catalogue.products",
    "pk": 33,
    "fields": {
      "name": "Грокаем машинное обучение",
      "slug": "grokaem-mashinnoe-obuchenie",
      "author": "Луис Серрано",
      "publisher": "Питер",
      "isbn": "978-5-4461-1923-3",
      "year": 2024,
      "number_of_pages": 512,
      "description": "Машинное обучение — это набор методов анализа данных, основанных на алгоритмах, которые дают все более точные результаты по мере поступления новых данных. Машинное обучение лежит в основе систем рекомендаций, программ распознавания лиц, «умных» колонок и даже беспилотных автомобилей. Эта уникальная книга объясняет основные понятия машинного обучения на простых и доступных примерах, увлекательных упражнениях и запоминающихся иллюстрациях.\r\nЗдесь нет зубодробительного академического жаргона, для понимания объяснений достаточно знаний основ алгебры. По мере чтения вы будете создавать модели для идентификации спама, и распознавания изображений и другие интересные проекты на языке Python.\r\n\r\nОткройте для себя мощные методы машинного обучения, для понимания и применения которых достаточно знаний математики на уровне средней школы!\r\n\r\nДля читателей, знающих основы языка Python. Знаний в области машинного обучения не требуется.",
      "price": "356.00",
      "quantity": 0,
      "book_theme": "data",
      "programming_language": "Python",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 2
    }
  },
  {
    "model": "catalogue.products",
    "pk": 34,
    "fields": {
      "name": "Linux для сетевых инженеров",
      "slug": "linux-dlya-setevyh-inzhenerov",
      "author": "Роб Ванденбринк",
      "publisher": "Питер",
      "isbn": "978-5-4461-2275-2",
      "year": 2024,
      "number_of_pages": 496,
      "description": "Операционная система Linux продолжает завоевывать популярность, и все больше сетевых служб разворачивается на ее основе из соображений стоимости и гибкости. Книга даст исчерпывающее представление о том, как устроена работа с сетью в Linux. В начале описаны основные дистрибутивы и рассказано, как выбрать правильный и настроить простейшую сетевую конфигурацию. Затем идет речь о диагностике, брандмауэре и использовании Linux в качестве узла для сетевых служб. Наконец, работая с примерами сборок, вы овладеете различными вариантами защиты от распространенных видов атак. Освоив последние главы, станете еще на шаг ближе к тому, чтобы построить надежный каркас для центра обработки данных, функционирующего полностью под управлением Linux.\r\nВы сможете не только уверенно настраивать систему, но и использовать проверенные методологии для будущих развертываний.",
      "price": "567.00",
      "quantity": 10,
      "book_theme": "devops",
      "programming_language": "OT",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 2
    }
  },
  {
    "model": "catalogue.products",
    "pk": 35,
    "fields": {
      "name": "Программирование для непрограммистов в изложении на человеческом языке",
      "slug": "programmirovanie-dlya-neprogrammistov-v-izlozhenii-na-chelovecheskom-yazyke",
      "author": "Антти Салонен",
      "publisher": "ACT",
      "isbn": "978-5-17-160253-6",
      "year": 2024,
      "number_of_pages": 480,
      "description": "Данное издание адресовано тем, кто всерьез интересуется разработкой программного обеспечения и стремится получить необходимые практические навыки в этом непростом деле, но пока имеет мало опыта в программировании или вовсе не имеет такового. Новичкам, которые хотят научиться писать рабочие коды, однако пока не имеют возможности получить специализированное университетское образование в данной сфере, этот своеобразный обучающий практикум даст четкое представление о том, какие знания наиболее важны для разработчика ПО и к чему нужно быть готовым при выборе профессии программиста. Самостоятельно обучаясь программированию при помощи этой книги, написанной простым и доступным языком, можно освоить базовые подходы, которыми пользуются профессиональные программисты, научиться применять на практике их основные инструменты, поэтапно, шаг за шагом продвигаясь от азов к запуску рабочего кода. В страницах издания изложены основы нескольких важнейших языков программирования, дается множество практических советов с реальными примерами из практики разработчиков и подробным разбором задач, но главное достоинство книги - ее универсальность и всеохватность: под одной обложкой автору удалось сконцентрировать все самое важное из большого числа тем и собрать воедино актуальную информацию из множества источников, предоставляя начинающим разработчикам надежный фундамент, необходимый для создания программного обеспечения.",
      "price": "320.00",
      "quantity": 1,
      "book_theme": "CS",
      "programming_language": "OT",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 1
    }
  },
  {
    "model": "catalogue.products",
    "pk": 36,
    "fields": {
      "name": "Python. Создай свою первую игру с нуля! Самоучитель в примерах",
      "slug": "python-sozdaj-svoyu-pervuyu-igru-s-nulya-samouchitel-v-primerah",
      "author": "Кенлон, Вейхлер",
      "publisher": "ACT",
      "isbn": "978-5-17-160254-3",
      "year": 2024,
      "number_of_pages": 160,
      "description": "Эта книга - практическое пособие для начинающих программистов, желающих научиться создавать с нуля компьютерные игры на \"дружественном\" для новичков языке Python. Каждый ее раздел представляет собой проектирование очередного этапа игры, включая придумывание и \"оживление\" игрового персонажа, его противников, разработку дополнительных игровых элементов и налаживание их взаимодействия между собой. Кроме того, в ней рассмотрены тонкие моменты, связанные с подготовкой графических изображений и звуковых файлов с целью создания визуальных и звуковых эффектов. Все разделы содержат примеры исходного кода с подробным описанием работы каждого его фрагмента. Авторы доступным языком описывают, как использовать библиотеку Pygame для выстраивания графики, обработки пользовательского ввода и управления игровым процессом, что делает материал понятным для новичков, и дают ссылки на исходный код, который можно скопировать и сразу запустить на своем компьютере. Данное издание поможет овладеть основами разработки игр на Python и, несомненно, вдохновит на создание собственных игровых проектов, где для фантазий и их программного воплощения не существует границ.",
      "price": "199.00",
      "quantity": 1,
      "book_theme": "gamedev",
      "programming_language": "Python",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 1
    }
  },
  {
    "model": "catalogue.products",
    "pk": 37,
    "fields": {
      "name": "Теория языков и языковых процессоров. Учебник для вузов",
      "slug": "teoriya-yazykov-i-yazykovyh-processorov-uchebnik-dlya-vuzov",
      "author": "Юрий Шорников",
      "publisher": "Лань",
      "isbn": "978-5-507-48427-0",
      "year": 2024,
      "number_of_pages": 292,
      "description": "Учебник подготовлен в соответствии с Государственным образовательным стандартом по направлениям \"Информатика и вычислительная техника\", \"Прикладная информатика\" для цикла дисциплин информационных специальностей. Основой учебника стал материал, прочитанный автором студентам соответствующих специальностей в Новосибирском государственном техническом университете и Казахстанско-Британском техническом университете в курсах \"Теория формальных языков и компиляторов\", \"Системное программное обеспечение\", \"Лингвистическое обеспечение\".\r\nВ учебнике рассмотрена теория порождающих грамматик, конечных автоматов и регулярных выражений. Все теоретические механизмы анализа и синтеза языковых конструкций строго формализованы и составляют теоретические основы проектирования языков программирования. Реализация языков программирования представлена разработкой языковых процессоров. Переход от формальных языков к языковым процессорам выполнен через конструктивные методы анализа со строгими моделирующими алгоритмами, которые могут быть реализованы на языках высокого уровня или с помощью современных средств автоматизации программирования. В учебнике рассмотрены средства ANTLR и FLEX & BIZON для автоматизации программирования парсера и лексера.\r\nНесмотря на образовательную направленность, учебник может быть полезен всем, кто занимается проектированием и реализацией новых языков, языковых процессоров и конечно-автоматных распознавателей.",
      "price": "403.00",
      "quantity": 0,
      "book_theme": "OT",
      "programming_language": "OT",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 4
    }
  },
  {
    "model": "catalogue.products",
    "pk": 38,
    "fields": {
      "name": "Методы прогнозирования временных рядов. Учебное пособие для вузов",
      "slug": "metody-prognozirovaniya-vremennyh-ryadov-uchebnoe-posobie-dlya-vuzov",
      "author": "Владимир Наумов",
      "publisher": "Лань",
      "isbn": "978-5-507-48837-7",
      "year": 2024,
      "number_of_pages": 196,
      "description": "В книге рассмотрены наиболее популярные методы и модели предсказательной аналитики данных, представленных временными рядами. Дана их характеристика, выполнен сравнительный анализ. Приведены примеры решения задач прогнозирования для классических и синтезированных наборов данных. В качестве инструмента решения задач прогнозирования был выбран язык R и интегрированная среда разработки RStudio. Их выбор обусловлен ориентацией языка и интегрированной среды на решение задач аналитики, появлением философии аккуратного (опрятного) программирования, которая существенно изменяет традиционные подходы к их использованию при прогнозировании временных рядов.\r\nКнига может быть полезна как студентам, магистрантам и аспирантам, изучающим методы прогнозирования, анализа данных, машинного обучения, предсказательной аналитики, искусственного интеллекта, теорию data science, так и аналитикам, начинающим осваивать данные методы для применения в своей практической деятельности. Содержание книги предполагает, что ее читатели имеют базовые знания о языке R, начальный опыт использования языка R и интегрированной среды разработки RStudio. Поэтому в ней не рассмотрены основы языка и организации применения данной среды.",
      "price": "249.00",
      "quantity": 2,
      "book_theme": "data",
      "programming_language": "OT",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 3
    }
  },
  {
    "model": "catalogue.products",
    "pk": 39,
    "fields": {
      "name": "Поведение потребителей. Учебник",
      "slug": "povedenie-potrebitelej-uchebnik",
      "author": "Владимир Наумов",
      "publisher": "ИНФРА-М",
      "isbn": "978-5-16-015021-5",
      "year": 2023,
      "number_of_pages": 345,
      "description": "В учебнике рассмотрены базовые вопросы, касающиеся поведения потребителей, на принципе моделирования процессов принятия решений о покупке, поведения покупателей в торговом зале магазина и на торговых интернет-площадках.\r\nПредложена классификация моделей поведения потребителей, в основу которой положены исследования в области экономической, социальной и психологической теорий, а также эмпирические данные, касающиеся принятия решений потребителями при покупке товаров, в том числе в интернет-магазинах. Изложены методы качественных и количественных исследований поведения потребителей, основы статистической обработки эмпирических данных.\r\nУделено внимание процессам восприятия потребителями торговых марок (брендов) и рекламных сообщений, рассмотрены основные правила выкладки товаров (мерчандайзинг) и ее влияние на решение потребителя, даны рекомендации по использованию психологии поведения потребителей в личных продажах.\r\nПредставлена интегрированная модель поведения потребителей в интернет-среде, рассмотрен процесс восприятия посетителем сайта компании, приведены факторы, влияющие на потребительский выбор товара в интернете.",
      "price": "399.00",
      "quantity": 4,
      "book_theme": "analytics",
      "programming_language": "OT",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 3
    }
  },
  {
    "model": "catalogue.products",
    "pk": 40,
    "fields": {
      "name": "Изучаем vi и Vim. Не просто редакторы",
      "slug": "izuchaem-vi-i-vim-ne-prosto-redaktory",
      "author": "Роббинс, Ханна",
      "publisher": "Питер",
      "isbn": "978-5-4461-2019-2",
      "year": 2023,
      "number_of_pages": 528,
      "description": "Среди текстовых редакторов, используемых программистами, самыми важными является vi и его вариации. В обновленном издании пользователи Unix и Linux изучат основы редактирования текста как в vi, так и в Vim (vi improved), прежде чем перейти к более продвинутым инструментам в каждой из программ. Авторы Арнольд Роббинс и Элберт Ханна описывают основные новейшие версии Vim.\r\nЕсли вы программист или компьютерный аналитик, либо работаете с веб- или консольными интерфейсами, Vim упростит решение сложных задач. Вы освоите многооконное редактирование, глобальный поиск/замену и прочие мощные инструменты для программистов, а также научитесь писать интерактивные макросы и сценарии, расширяющие возможности программы.\r\nПодробнее: https://www.labirint.ru/books/962174/",
      "price": "670.00",
      "quantity": 2,
      "book_theme": "devops",
      "programming_language": "OT",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 3
    }
  },
  {
    "model": "catalogue.products",
    "pk": 41,
    "fields": {
      "name": "Карьера Software Engineering Manager. Эффективное управление командой разработчиков",
      "slug": "karera-software-engineering-manager-effektivnoe-upravlenie-komandoj-razrabotchikov",
      "author": "Джеймс Стэньер",
      "publisher": "Питер",
      "isbn": "978-5-4461-2069-7",
      "year": 2024,
      "number_of_pages": 416,
      "description": "Перед вами неожиданно открылась возможность возглавить команду разработчиков ПО? Пора становиться менеджером? Как решить, подходит ли вам такой шаг в карьере? И если да, то чему нужно научиться, чтобы добиться успеха? С чего начать? Как понять, что вы все делаете правильно? Что вообще означает «менеджмент»? Джеймс Стэньер делится секретами, которые необходимо знать, чтобы успешно управлять командой разработчиков.\r\nСмена статуса с «инженер-разработчик» на «руководитель команды» не должна вас пугать — инженеры могут быть менеджерами, причем идеальными.\r\n\r\nОтбросьте болтовню и сосредоточьтесь на практических методах и инструментах. Вы станете эффективным лидером команды, на которого будут равняться ваши сотрудники.",
      "price": "369.00",
      "quantity": 3,
      "book_theme": "analytics",
      "programming_language": "OT",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 2
    }
  },
  {
    "model": "catalogue.products",
    "pk": 42,
    "fields": {
      "name": "Грокаем глубокое обучение с подкреплением",
      "slug": "grokaem-glubokoe-obuchenie-s-podkrepleniem",
      "author": "Мигель Моралес",
      "publisher": "Питер",
      "isbn": "978-5-4461-3944-6",
      "year": 2023,
      "number_of_pages": 464,
      "description": "Мы учимся, взаимодействуя с окружающей средой, и получаемые вознаграждения и наказания определяют наше поведение в будущем. Глубокое обучение с подкреплением привносит этот естественный процесс в искусственный интеллект и предполагает анализ результатов для выявления наиболее эффективных путей движения вперед. Агенты глубокого обучения с подкреплением могут способствовать успеху маркетинговых кампаний, прогнозировать рост акций и побеждать гроссмейстеров в Го и шахматах.\r\nДавайте научимся создавать системы глубокого обучения на примере увлекательных упражнений, сопровождаемых кодом на Python с подробными комментариями и понятными объяснениями. Вы увидите, как работают алгоритмы, и научитесь создавать собственных агентов глубокого обучения с подкреплением, используя оценочную обратную связь.",
      "price": "399.00",
      "quantity": 3,
      "book_theme": "ai",
      "programming_language": "Python",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 3
    }
  },
  {
    "model": "catalogue.products",
    "pk": 43,
    "fields": {
      "name": "Python за 7 дней. Краткий курс для начинающих",
      "slug": "python-za-7-dnej-kratkij-kurs-dlya-nachinayushih",
      "author": "Эндрю Парк",
      "publisher": "Питер",
      "isbn": "978-5-4461-2057-4",
      "year": 2023,
      "number_of_pages": 256,
      "description": "Хотите за одну неделю освоить самый популярный язык программирования? Надоело разбираться в море хаотичной и неструктурированной информации из многочисленных бесплатных онлайн-источников?\r\nХорошая новость! Не нужно тратить время, чтобы осилить сложные академические тексты, неоправданно дорогие онлайн-курсы или видеотуториалы, которые содержат слишком много технических деталей, непонятных для начинающих.\r\nКнига \"Python за 7 дней\" написана специально для новичков в программировании. Ее основные принципы - это простота и практичность\r\n\r\nВы познакомитесь с кратким введением в Python, чтобы понять какую пользу можно извлечь, изучая его; узнаете как установить Python и какой дистрибутив лучше использовать; разберетесь с объектами и методами (включая ООП), чтобы эффективно использовать этот удобный язык и его простой синтаксис.\r\nПрактические упражнения в конце каждой главы идеально подойдут для отработки навыков программирования.",
      "price": "299.00",
      "quantity": 3,
      "book_theme": "OT",
      "programming_language": "Python",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 1
    }
  },
  {
    "model": "catalogue.products",
    "pk": 44,
    "fields": {
      "name": "SQL Server. Наладка и оптимизация для профессионалов",
      "slug": "sql-server-naladka-i-optimizaciya-dlya-professionalov",
      "author": "Дмитрий Короткевич",
      "publisher": "Питер",
      "isbn": "978-5-4461-2332-2",
      "year": 2023,
      "number_of_pages": 512,
      "description": "Исчерпывающий обзор лучших практик по устранению неисправностей и оптимизации производительности Microsoft SQL Server. Специалисты по базам данных, в том числе разработчики и администраторы, научатся выявлять проблемы с производительностью, системно устранять неполадки и расставлять приоритеты при тонкой настройке, чтобы достичь максимальной эффективности.\r\n\r\nАвтор книги Дмитрий Короткевич - Microsoft Data Platform MVP и Microsoft Certified Master (MCM) - расскажет о взаимозависимостях между компонентами баз данных SQL Server. Вы узнаете, как быстро провести диагностику системы и найти причину любой проблемы. Методы, описанные в книге, совместимы со всеми версиями SQL Server и подходят как для локальных, так и для облачных конфигураций SQL Server.",
      "price": "499.00",
      "quantity": 6,
      "book_theme": "OT",
      "programming_language": "SQL",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 5
    }
  },
  {
    "model": "catalogue.products",
    "pk": 45,
    "fields": {
      "name": "JavaScript с нуля до профи",
      "slug": "javascript-s-nulya-do-profi",
      "author": "Свекис, Персиваль, Ван",
      "publisher": "Питер",
      "isbn": "978-5-4461-2269-1",
      "year": 2023,
      "number_of_pages": 480,
      "description": "Книга демонстрирует возможности JavaScript для разработки веб-приложений, сочетая теорию с упражнениями и интересными проектами. Она показывает, как простые методы JavaScript могут применяться для создания веб-приложений, начиная от динамических веб-сайтов и заканчивая простыми браузерными играми.\r\n\r\nВ \"JavaScript с нуля до профи\" основное внимание уделяется ключевым концепциям программирования и манипуляциям с объектной моделью документа для решения распространенных проблем в профессиональных веб-приложениях. К ним относятся проверка данных, управление внешним видом веб-страниц и работа с асинхронным и многопоточным кодом.\r\n\r\nОбучайтесь на основе проектов, дополняющих теоретические блоки и серии примеров кода, которые могут быть использованы в качестве модулей различных приложений, таких как валидаторы входных данных, игры и простые анимации. Обучение дополнено ускоренным курсом по HTML и CSS, чтобы проиллюстрировать, как компоненты JavaScript вписываются в полноценное веб-приложение.",
      "price": "399.00",
      "quantity": 3,
      "book_theme": "OT",
      "programming_language": "JavaScript",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 1
    }
  },
  {
    "model": "catalogue.products",
    "pk": 46,
    "fields": {
      "name": "Рекурсивная книга о рекурсии",
      "slug": "rekursivnaya-kniga-o-rekursii",
      "author": "Эл Свейгарт",
      "publisher": "Питер",
      "isbn": "978-5-4461-2393-3",
      "year": 2023,
      "number_of_pages": 336,
      "description": "Книга \"Рекурсивная книга о рекурсии\" содержит примеры кода на языке Python и JavaScript, которые иллюстрируют основы рекурсии и проясняют фундаментальные принципы всех рекурсивных алгоритмов. Из книги вы узнаете о том, когда стоит использовать рекурсивные функции (и, главное, когда этого не нужно делать), как реализовывать классические рекурсивные алгоритмы, часто обсуждаемые на собеседованиях, а также о том, как рекурсивные методы помогают решать задачи, связанные с обходом дерева, комбинаторикой и другими сложными темами.",
      "price": "310.00",
      "quantity": 2,
      "book_theme": "CS",
      "programming_language": "OT",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 2
    }
  },
  {
    "model": "catalogue.products",
    "pk": 47,
    "fields": {
      "name": "Software. Ошибки и компромиссы при разработке ПО",
      "slug": "software-oshibki-i-kompromissy-pri-razrabotke-po",
      "author": "Лелек, Скит",
      "publisher": "Питер",
      "isbn": "978-5-4461-2320-9",
      "year": 2023,
      "number_of_pages": 464,
      "description": "Создание программных продуктов всегда связано с компромиссами. В попытках сбалансировать скорость, безопасность, затраты, время доставки, функции и многие другие факторы можно обнаружить, что вполне разумное дизайнерское решение на практике оказывается сомнительным. Советы экспертов и яркие примеры, представленные в этой книге, научат вас делать правильный выбор в дизайне и проектировании приложений.\r\nМы будем рассматривать реальные сценарии, в которых были приняты неверные решения, а затем искать пути, позволяющие исправить подобную ситуацию. Томаш Лелек и Джон Скит делятся опытом, накопленным за десятки лет разработки ПО, в том числе рассказывают о собственных весьма поучительных ошибках. Вы по достоинству оцените конкретные советы и практические методы, а также неустаревающие паттерны, которые изменят ваш подход к проектированию.",
      "price": "576.00",
      "quantity": 0,
      "book_theme": "OT",
      "programming_language": "OT",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 5
    }
  },
  {
    "model": "catalogue.products",
    "pk": 48,
    "fields": {
      "name": "Объекты. Стильное ООП",
      "slug": "obekty-stilnoe-oop",
      "author": "Маттиас Нобак",
      "publisher": "Питер",
      "isbn": "978-5-4461-1841-0",
      "year": 2023,
      "number_of_pages": 304,
      "description": "Хороший объектно-ориентированный код удобно читать, изменять и исправлять. Универсальные практики проектирования объектов, собранные в этой книге, позволят улучшить ваш стиль кодирования. Эти правила подойдут к любому объектно-ориентированному языку, они делают код максимально понятным и надежным, а также повышают производительность как индивидуальных разработчиков, так и команд.\r\n\r\nКнига \"Объекты. Стильное ООП\" познакомит вас с профессиональными техниками написания ОО-кода. Маттиас Нобак раскрывает правила создания объектов, определения методов, изменения и извлечения состояний и многое другое. Все примеры написаны на простом псевдокоде, который легко перевести в любой язык программирования. Кейс за кейсом вы изучите ключевые сценарии и задачи проектирования объектов, а затем шаг за шагом создадите простое веб-приложение, которое покажет, как должны взаимодействовать объекты разных типов.",
      "price": "532.00",
      "quantity": 0,
      "book_theme": "CS",
      "programming_language": "OT",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 1
    }
  },
  {
    "model": "catalogue.products",
    "pk": 49,
    "fields": {
      "name": "Машинное обучение. Портфолио реальных проектов",
      "slug": "mashinnoe-obuchenie-portfolio-realnyh-proektov",
      "author": "Алексей Григорьев",
      "publisher": "Питер",
      "isbn": "978-5-4461-1978-3",
      "year": 2023,
      "number_of_pages": 496,
      "description": "Изучите ключевые концепции машинного обучения‚ работая над реальными проектами! Машинное обучение - то, что поможет вам в анализе поведения клиентов, прогнозировании тенденций движения цен, оценке рисков и многом другом. Чтобы освоить машинное обучение, вам нужны отличные примеры, четкие объяснения и много практики. В книге все это есть!\r\nАвтор описывает реалистичные, практичные сценарии машинного обучения, а также предельно понятно раскрывает ключевые концепции. Вы разберете интересные проекты, такие как сервис прогнозирования цен на автомобили с использованием линейной регрессии и сервис прогнозирования оттока клиентов. Вы выйдете за рамки алгоритмов и изучите важные техники, например развертывание приложений в бессерверных системах и запуск моделей с помощью Kubernetes и Kubeflow. Пришло время закатать рукава и прокачать свои навыки в области машинного обучения!",
      "price": "356.00",
      "quantity": 0,
      "book_theme": "ai",
      "programming_language": "OT",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 3
    }
  },
  {
    "model": "catalogue.products",
    "pk": 50,
    "fields": {
      "name": "Kafka Streams и ksqlDB. Данные в реальном времени",
      "slug": "kafka-streams-i-ksqldb-dannye-v-realnom-vremeni",
      "author": "Митч Сеймур",
      "publisher": "Питер",
      "isbn": "978-5-4461-3945-3",
      "year": 2023,
      "number_of_pages": 432,
      "description": "Работа с неограниченными и быстрыми потоками данных всегда была сложной задачей. Но Kafka Streams и ksqlDB позволяют легко и просто создавать приложения потоковой обработки. Из книги специалисты по обработке данных узнают, как с помощью этих инструментов создавать масштабируемые приложения потоковой обработки, перемещающие, обогащающие и преобразующие большие объемы данных в режиме реального времени.\r\nМитч Сеймур, инженер службы обработки данных в Mailchimp, объясняет важные понятия потоковой обработки на примере нескольких любопытных бизнес-задач. Он рассказывает о достоинствах Kafka Streams и ksqlDB, чтобы помочь вам выбрать наиболее подходящий инструмент для каждого уникального проекта потоковой обработки. Для разработчиков, не пишущих код на Java, особенно ценным будет материал, посвященный ksqlDB.\r\nПодробнее: https://www.labirint.ru/books/924013/Работа с неограниченными и быстрыми потоками данных всегда была сложной задачей. Но Kafka Streams и ksqlDB позволяют легко и просто создавать приложения потоковой обработки. Из книги специалисты по обработке данных узнают, как с помощью этих инструментов создавать масштабируемые приложения потоковой обработки, перемещающие, обогащающие и преобразующие большие объемы данных в режиме реального времени.\r\nМитч Сеймур, инженер службы обработки данных в Mailchimp, объясняет важные понятия потоковой обработки на примере нескольких любопытных бизнес-задач. Он рассказывает о достоинствах Kafka Streams и ksqlDB, чтобы помочь вам выбрать наиболее подходящий инструмент для каждого уникального проекта потоковой обработки. Для разработчиков, не пишущих код на Java, особенно ценным будет материал, посвященный ksqlDB.",
      "price": "255.00",
      "quantity": 0,
      "book_theme": "devops",
      "programming_language": "OT",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 4
    }
  },
  {
    "model": "catalogue.products",
    "pk": 51,
    "fields": {
      "name": "Алгоритмы на практике. Решение реальных задач",
      "slug": "algoritmy-na-praktike-reshenie-realnyh-zadach",
      "author": "Даниэль Зингаро",
      "publisher": "Питер",
      "isbn": "978-5-4461-1853-3",
      "year": 2023,
      "number_of_pages": 432,
      "description": "\"Алгоритмы на практике\" научат решать самые трудные и интересные программистские задачи, а также разрабатывать собственные алгоритмы. В качестве примеров для обучения взяты реальные задания с международных соревнований по программированию. Вы узнаете, как классифицировать задачи, правильно подбирать структуру данных и выбирать алгоритм для решения. Поймете, что выбор структуры данных - будь то хеш-таблица, куча или дерево -влияет на скорость выполнения программы и на эффективность алгоритма. Разберетесь, как применять рекурсию, динамическое программирование, двоичный поиск.\r\n\r\nНикакого условного псевдокода, все примеры сопровождаются исходным кодом на языке Си подробными объяснениями.",
      "price": "654.00",
      "quantity": 0,
      "book_theme": "CS",
      "programming_language": "C",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 2
    }
  },
  {
    "model": "catalogue.products",
    "pk": 52,
    "fields": {
      "name": "Грокаем функциональное мышление",
      "slug": "grokaem-funkcionalnoe-myshlenie",
      "author": "Эрик Норманд",
      "publisher": "Питер",
      "isbn": "978-5-4461-1887-8",
      "year": 2023,
      "number_of_pages": 608,
      "description": "Кодовые базы разрастаются, становясь всё сложнее и запутаннее, что не может не пугать разработчиков. Как обнаружить код, изменяющий состояние вашей системы? Как сделать код таким, чтобы он не увеличивал сложность и запутанность кодовой базы?\r\nБольшую часть \"действий\", изменяющих состояние, можно превратить в \"вычисления\", чтобы ваш код стал проще и логичнее.\r\nВы научитесь бороться со сложными ошибками синхронизации, которые неизбежно проникают в асинхронный и многопоточный код, узнаете, как компонуемые абстракции предотвращают дублирование кода, и откроете для себя новые уровни его выразительности.\r\n\r\nКнига предназначена для разработчиков среднего и высокого уровня, создающих сложный код. Примеры, иллюстрации, вопросы для самопроверки и практические задания помогут надежно закрепить новые знания.",
      "price": "705.00",
      "quantity": 3,
      "book_theme": "OT",
      "programming_language": "OT",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 3
    }
  },
  {
    "model": "catalogue.products",
    "pk": 53,
    "fields": {
      "name": "Computer Science для программиста-самоучки. Все что нужно знать о структурах данных и алгоритмах",
      "slug": "computer-science-dlya-programmista-samouchki-vse-chto-nuzhno-znat-o-strukturah-dannyh-i-algoritmah",
      "author": "Кори Альтхофф",
      "publisher": "Питер",
      "isbn": "978-5-4461-2010-9",
      "year": 2023,
      "number_of_pages": 240,
      "description": "Книги Кори Альтхоффа вдохновили сотни тысяч людей на самостоятельное изучение программирования. Чтобы стать профи в программировании, не обязательно иметь диплом в области computer science, и личный опыт Кори подтверждает это: он стал разработчиком ПО в eBay и добился этого самостоятельно.\r\nПознакомьтесь с наиболее важными темами computer science, в которых должен разбираться каждый программист-самоучка, мечтающий о выдающейся карьере, - это структуры данных и алгоритмы. \"Computer Science для программиста-самоучки\" поможет вам пройти техническое интервью, без которого нельзя получить работу в \"айти\".\r\nКнига написана для абсолютных новичков, поэтому у вас не должно возникнуть трудностей, даже если ранее вы ничего не слышали о computer science.",
      "price": "290.00",
      "quantity": 3,
      "book_theme": "CS",
      "programming_language": "OT",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 1
    }
  },
  {
    "model": "catalogue.products",
    "pk": 54,
    "fields": {
      "name": "Математические алгоритмы для программистов. 3D-графика, машинное обучение и моделирование на Python",
      "slug": "matematicheskie-algoritmy-dlya-programmistov-3d-grafika-mashinnoe-obuchenie-i-modelirovanie-na-python",
      "author": "Пол Орланд",
      "publisher": "Питер",
      "isbn": "978-5-4461-2287-5",
      "year": 2023,
      "number_of_pages": 752,
      "description": "Неважно, чем вы занимаетесь - большими данными, машинным обучением, компьютерной графикой или криптографией - без математики вам не обойтись! Везде сейчас требуются базовые знания и понимание алгоритмов.\r\nПрактические примеры позволят легко разобраться с самыми необходимыми математическими понятиями. 300 упражнений и мини-проектов откроют вам новые возможности в освоении интересных и популярных IT-профессий. Вы познакомитесь с базовыми библиотеками Python, используемыми при разработке реальных приложений, и вспомните давно забытые основы линейной алгебры и матана.",
      "price": "540.00",
      "quantity": 4,
      "book_theme": "CS",
      "programming_language": "OT",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 1
    }
  },
  {
    "model": "catalogue.products",
    "pk": 55,
    "fields": {
      "name": "Pandas в действии",
      "slug": "pandas-v-dejstvii",
      "author": "Борис Пасхавер",
      "publisher": "Питер",
      "isbn": "978-5-4461-1941-7",
      "year": 2023,
      "number_of_pages": 512,
      "description": "Язык Python помогает упростить анализ данных. Если вы научились пользоваться электронными таблицами, то сможете освоить и pandas! Несмотря на сходство с табличной компоновкой Excel, pandas обладает большей гибкостью и более широкими возможностями. Эта библиотека для Python быстро выполняет операции с миллионами строк и способна взаимодействовать с другими инструментами. Она дает идеальную возможность выйти на новый уровень анализа данных.",
      "price": "730.00",
      "quantity": 3,
      "book_theme": "OT",
      "programming_language": "Python",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 3
    }
  },
  {
    "model": "catalogue.products",
    "pk": 56,
    "fields": {
      "name": "Тестирование JavaScript",
      "slug": "testirovanie-javascript",
      "author": "Лукас Коста",
      "publisher": "Питер",
      "isbn": "978-5-4461-3913-2",
      "year": 2023,
      "number_of_pages": 592,
      "description": "Автоматизированное тестирование - залог стабильной разработки качественных приложений. Полноценное тестирование должно охватывать отдельные функции, проверять интеграцию разных частей вашего кода и обеспечивать корректность с точки зрения пользователя. Книга научит вас быстро и уверенно создавать надежное программное обеспечение. Вы узнаете, как реализовать план автоматизированного тестирования для JavaScript-приложений. В издании описываются стратегии тестирования, обсуждаются полезные инструменты и библиотеки, а также объясняется, как развивать культуру, ориентированную на качество. Вы исследуете подходы к тестированию как серверных, так и клиентских приложений, а также научитесь проверять свое программное обеспечение быстрее и надежнее.",
      "price": "580.00",
      "quantity": 6,
      "book_theme": "OT",
      "programming_language": "JavaScript",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 4
    }
  },
  {
    "model": "catalogue.products",
    "pk": 57,
    "fields": {
      "name": "Знакомство с Python",
      "slug": "znakomstvo-s-python",
      "author": "Бейдер, Эймос, Яблонски",
      "publisher": "Питер",
      "isbn": "978-5-4461-1924-0",
      "year": 2023,
      "number_of_pages": 512,
      "description": "Пытаетесь найти что-нибудь для начинающих о языке Python в интернете? Не можете решить, с чего начать? Как структурировать это море информации? В каком порядке изучать?\r\nЕсли вы задаетесь подобными вопросами, потому что хотите заложить фундамент будущей карьеры питониста — эта книга для вас!\r\nВместо скучного перечисления возможностей языка авторы рассказывают, как сочетать разные структурные элементы Python, чтобы сразу создавать скрипты и приложения.\r\nКнига построена по принципу 80/20: большую часть полезной информации можно усвоить, изучив несколько критически важных концепций. Освоив самые популярные команды и приемы, вы сразу сосредоточитесь на решении реальных повседневных задач.",
      "price": "460.00",
      "quantity": 0,
      "book_theme": "OT",
      "programming_language": "Python",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 1
    }
  },
  {
    "model": "catalogue.products",
    "pk": 58,
    "fields": {
      "name": "Создание приложений машинного обучения. От идеи к продукту",
      "slug": "sozdanie-prilozhenij-mashinnogo-obucheniya-ot-idei-k-produktu",
      "author": "Эммануэль Амейзен",
      "publisher": "Питер",
      "isbn": "978-5-4461-1773-4",
      "year": 2023,
      "number_of_pages": 256,
      "description": "Освойте ключевые навыки проектирования, разработки и развертывания приложений на базе машинного обучения (МО)!\r\nПошаговое руководство по созданию МО-приложений с упором на практику: для специалистов по обработке данных, разработчиков программного обеспечения и продакт-менеджеров.\r\nЧитая эту книгу, вы шаг за шагом создадите реальное практическое приложение — от идеи до внедрения. В вашем распоряжении примеры кодов, иллюстрации, скриншоты и интервью с ведущими специалистами отрасли.\r\n\r\nВы научитесь планировать и измерять успех МО-проектов, разберетесь, как построить рабочую модель, освоите способы ее итеративной доработки. И, наконец, познакомитесь со стратегиями развертывания и мониторинга.\r\n\r\nКнига поможет:\r\n• Определить цель вашего МО-проекта\r\n• Быстро построить первый сквозной пайплайн и найти исходный датасет\r\n• Обучить модель и устранить узкие места в ее производительности\r\n• Развернуть модель и осуществить ее мониторинг",
      "price": "310.00",
      "quantity": 1,
      "book_theme": "OT",
      "programming_language": "OT",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 1
    }
  },
  {
    "model": "catalogue.products",
    "pk": 59,
    "fields": {
      "name": "PyTorch. Освещая глубокое обучение",
      "slug": "pytorch-osveshaya-glubokoe-obuchenie",
      "author": "Стивенс, Виман, Антига",
      "publisher": "Питер",
      "isbn": "978-5-4461-1945-5",
      "year": 2022,
      "number_of_pages": 576,
      "description": "Многие средства глубокого обучения используют Python, но именно библиотека PyTorch по-настоящему «питоническая». Легкая в освоении для тех, кто знаком с NumPy и scikit-learn, PyTorch упрощает работу с глубоким обучением, обладая в то же время богатым набором функций. PyTorch прекрасно подходит для быстрого создания моделей и без проблем масштабируется до корпоративного проекта. PyTorch используют такие компании как Apple и JPMorgan Chase.\r\n\r\nНавыки работы с этой библиотекой пригодятся вам для карьерного роста. Вы научитесь создавать нейронные сети и системы глубокого обучения с помощью PyTorch. Книга поможет быстро приступить к созданию реального проекта с нуля. В ней описаны лучшие практики всего конвейера работы с данными, включая PyTorch Tensor API, загрузку данных на Python, мониторинг обучения и визуализацию полученных результатов.",
      "price": "512.00",
      "quantity": 2,
      "book_theme": "data",
      "programming_language": "OT",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 3
    }
  },
  {
    "model": "catalogue.products",
    "pk": 60,
    "fields": {
      "name": "Управление проектами с нуля",
      "slug": "upravlenie-proektami-s-nulya",
      "author": "Грег Хорин",
      "publisher": "Питер",
      "isbn": "978-5-4461-1622-5",
      "year": 2022,
      "number_of_pages": 464,
      "description": "Управлять проектами не так сложно, как может показаться! Эта книга — кратчайший путь для освоения всех необходимых навыков: от бюджетирования и планирования до секретов управления командой и работы над ошибками — лучшее на сегодняшний день руководство по современному проектному менеджменту для начинающих. Здесь вы найдете простые инструкции и чек-листы для успешного выполнения всех задач, которые могут возникнуть в ходе работы! Бонус — глава с полезными советами для подготовки к сдаче сертификационного экзамена PMP.",
      "price": "455.00",
      "quantity": 2,
      "book_theme": "analytics",
      "programming_language": "OT",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 1
    }
  },
  {
    "model": "catalogue.products",
    "pk": 61,
    "fields": {
      "name": "SQL. Быстрое погружение",
      "slug": "sql-bystroe-pogruzhenie",
      "author": "Уолтер Шилдс",
      "publisher": "Питер",
      "isbn": "978-5-4461-1835-9",
      "year": 2022,
      "number_of_pages": 224,
      "description": "Что общего между самыми востребованными профессиями и стремительным увеличением количества информации в мире? Ответ: язык структурированных запросов (SQL). SQL – рабочая лошадка среди языков программирования, основа основ для современного анализа и управления данными.\r\nКнига «SQL: быстрое погружение» идеальна для всех, кто ищет новые перспективы карьерного роста; для разработчиков, которые хотят расширить свои навыки и знания в программировании; для любого человека, даже без опыта, кто хочет воспользоваться возможностями будущего, в котором будут править данные.",
      "price": "224.00",
      "quantity": 2,
      "book_theme": "OT",
      "programming_language": "SQL",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 1
    }
  },
  {
    "model": "catalogue.products",
    "pk": 62,
    "fields": {
      "name": "Веб-дизайн для недизайнеров",
      "slug": "veb-dizajn-dlya-nedizajnerov",
      "author": "Трэйси Осборн",
      "publisher": "Питер",
      "isbn": "978-5-4461-1917-2",
      "year": 2022,
      "number_of_pages": 286,
      "description": "Пора сделать веб-разработку доступной для всех. Забавное, полезное и насыщенное информацией руководство охватывает все ключевые принципы дизайна, передовые практики, полезные шоткаты, профессиональные советы, реальные примеры и базовые знания программирования, необходимые для создания красивого веб-сайта, которым вы будете уверенно делиться со всем миром. Почему? Потому что вы научитесь разрабатывать современные сайты!\r\n\"Веб дизайн для недизайнеров\" содержит все необходимое, чтобы вы чувствовали себя комфортно, занимаясь веб-разработкой, в том числе множество реальных примеров веб-сайтов, которые должны вдохновлять и мотивировать. Не нужно тратить время и деньги на дорогого графического дизайнера, эта книга проведет вас через основы, воспользовавшись самыми быстрыми шоткатами - вы все сделаете сами, и прямо сейчас",
      "price": "300.00",
      "quantity": 1,
      "book_theme": "OT",
      "programming_language": "OT",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 1
    }
  },
  {
    "model": "catalogue.products",
    "pk": 63,
    "fields": {
      "name": "Open Source. Разработка программ с открытым исходным кодом",
      "slug": "open-source-razrabotka-programm-s-otkrytym-ishodnym-kodom",
      "author": "Надья Эгбал",
      "publisher": "Питер",
      "isbn": "978-5-4461-2918-8",
      "year": 2022,
      "number_of_pages": 288,
      "description": "Наши представления об открытом исходном коде сильно отличаются от того, что происходит на самом деле. Оптимистичная модель общественного сотрудничества давно ушла в прошлое, теперь - это царство одиночек.\r\nЕще совсем недавно информация была качественной, и работало правило - чем ее больше, тем лучше. Внезапно информации стало слишком много. Чем больше уведомлений на нас сыпется, тем меньше мы обращаем на них внимания. В мире программного обеспечения с открытым исходным кодом все происходит точно так же. Работа подразумевает коллективное взаимодействие, но пишущие и публикующие код разработчики настолько перегружены разнообразными запросами, что просто перестают на них реагировать.\r\nOpen Source - это \"дороги и мосты\" цифрового мира. Старт работ всегда связан с большим вложением сил и средств, но каждый дополнительный пользователь обходится относительно дешево. Мы не замечаем их пока все нормально, воспринимаем как что-то должное, но большинство таких проектов создаются энтузиастами.\r\nКак современному творцу разработать стратегию, создать продукт, обеспечить поддержку и заработать?\r\nНадья Эгбал проанализировала платформу GitHub, чтобы рассказать нам что такое современные проекты с открытым исходным кодом, который пишут отдельные разработчики, а используют миллионы.",
      "price": "288.00",
      "quantity": 3,
      "book_theme": "OT",
      "programming_language": "OT",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 2
    }
  },
  {
    "model": "catalogue.products",
    "pk": 64,
    "fields": {
      "name": "Теоретический минимум по Computer Science. Сети, криптография и data science",
      "slug": "teoreticheskij-minimum-po-computer-science-seti-kriptografiya-i-data-science",
      "author": "Феррейра, Пиктет",
      "publisher": "Питер",
      "isbn": "978-5-4461-2945-4",
      "year": 2022,
      "number_of_pages": 288,
      "description": "Хватит тратить время на занудные учебники! Это краткое и простое руководство предназначено для читателей, не заботящихся об академических формальностях.\r\nБольшинство технологических прорывов нашей эпохи происходят в цифровой среде, создаваемой программистами. Ученые-компьютерщики объединяют различные области исследований и расширяют возможности этого нового мира. Чтобы научиться плавать в океане информации, необходимо разбираться в основах сетевых технологий, криптографии и науке о данных.\r\nВы узнаете как эффективно манипулировать данными, освоите машинное обучение и современные концепции безопасности.\r\nРаскройте мощь Computer Science и станьте гуру цифровой эпохи!",
      "price": "365.00",
      "quantity": 11,
      "book_theme": "data",
      "programming_language": "OT",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 1
    }
  },
  {
    "model": "catalogue.products",
    "pk": 65,
    "fields": {
      "name": "Профессиональный бенчмарк. Искусство измерения производительности",
      "slug": "professionalnyj-benchmark-iskusstvo-izmereniya-proizvoditelnosti",
      "author": "Андрей Акиньшин",
      "publisher": "Питер",
      "isbn": "978-5-4461-1551-8",
      "year": 2022,
      "number_of_pages": 576,
      "description": "Это исчерпывающее руководство поможет вам правильно разрабатывать бенчмарки, измерять ключевые метрики производительности приложений .NET и анализировать результаты. В книге представлены десятки кейсов, проясняющих сложные аспекты бенчмаркинга. Ее изучение позволит вам избежать распространенных ошибок, проконтролировать точность измерений и повысить производительность своих программ.",
      "price": "467.00",
      "quantity": 2,
      "book_theme": "OT",
      "programming_language": "OT",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 5
    }
  },
  {
    "model": "catalogue.products",
    "pk": 66,
    "fields": {
      "name": "Изучаем C# через разработку игр на Unity",
      "slug": "izuchaem-c-cherez-razrabotku-igr-na-unity",
      "author": "Харрисон Ферроне",
      "publisher": "Питер",
      "isbn": "978-5-4461-2932-4",
      "year": 2022,
      "number_of_pages": 400,
      "description": "Изучение C# через разработку игр на Unity - популярный способ ускоренного освоения мощного и универсального языка программирования, используемого для решения прикладных задач в широком спектре предметных областей. Эта книга дает вам возможность с нуля изучить программирование на C# без зубодробительных терминов и непонятной логики программирования, причем процесс изучения сопровождается созданием простой игры на Unity.\r\nВ пятом издании изложены последние версии всех современных функций C# на примерах из игрового движка Unity, а также добавлена новая глава о промежуточных типах коллекций. Вы начнете с основ программирования и языка C#, узнаете основные концепции программирования на С#, включая переменные, классы и объектно-ориентированное программирование. Освоив программирование на C#, переключитесь непосредственно на разработку игр на Unity и узнаете, как написать сценарий простой игры на C#. На протяжении всей книги описываются лучшие практики программирования, которые помогут вам вывести свои навыки Unity и C# на новый уровень. В результате вы сможете использовать язык C # для создания собственных реальных проектов игр на Unity.",
      "price": "450.00",
      "quantity": 3,
      "book_theme": "gamedev",
      "programming_language": "C#",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 1
    }
  },
  {
    "model": "catalogue.products",
    "pk": 67,
    "fields": {
      "name": "Классические задачи Computer Science на языке Java",
      "slug": "klassicheskie-zadachi-computer-science-na-yazyke-java",
      "author": "Дэвид Копец",
      "publisher": "Питер",
      "isbn": "978-5-4461-3911-8",
      "year": 2022,
      "number_of_pages": 288,
      "description": "Столкнулись с \"неразрешимой\" проблемой при разработке программного обеспечения? Скорее всего, кто-то уже справился с этой задачей, и вы можете не ломать голову. Дэвид Копец собрал наиболее полезные готовые решения, принципы и алгоритмы. \"Классические задачи Computer Science на языке Java\" - это мастер-класс по программированию, содержащий 55 практических примеров, затрагивающих самые актуальные темы: базовые алгоритмы, ограничения, искусственный интеллект и многое другое.\r\n\r\nВ этой книге:\r\n- Рекурсия, мемоизация и битовые манипуляции.\r\n- Поисковые, графовые и генетические алгоритмы.\r\n- Проблемы ограничений.\r\n- Кластеризация методом k-среднего, нейронные сети и состязательный поиск.",
      "price": "305.00",
      "quantity": 4,
      "book_theme": "data",
      "programming_language": "Java",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 1
    }
  },
  {
    "model": "catalogue.products",
    "pk": 68,
    "fields": {
      "name": "Облачные архитектуры. Разработка устойчивых и экономичных облачных приложений",
      "slug": "oblachnye-arhitektury-razrabotka-ustojchivyh-i-ekonomichnyh-oblachnyh-prilozhenij",
      "author": "Лащевски, Арора, Фарр",
      "publisher": "Питер",
      "isbn": "978-5-4461-1588-4",
      "year": 2022,
      "number_of_pages": 320,
      "description": "Облачные вычисления - это, пожалуй, наиболее революционная разработка в IT со времен виртуализации. Облачно-ориентированные архитектуры обеспечивают большую гибкость по сравнению с системами предыдущего поколения. В этой книге продемонстрированы три важнейших аспекта развертывания современных cloud native архитектур: организационное преобразование, модернизация развертывания, паттерны облачного проектирования.\r\nКнига начинается с краткого знакомства с облачно-ориентированными архитектурами - на примерах объясняется, какие черты им присущи, а какие нет. Вы узнаете, как организуется внедрение и разработка облачных архитектур с применением микросервисов и бессерверных вычислений как основ проектирования. Далее вы изучите такие столпы облачно-ориентированного проектирования, как масштабируемость, оптимизация издержек, безопасность и способы достижения безупречной эксплуатационной надежности. В заключительных главах будет рассказано о различных общедоступных архитектурах cloud native, - от AWS и Azure до Google Cloud Platform.\r\nПрочитав эту книгу, вы освоите приемы, необходимые для перехода на облачно-ориентированные архитектуры с учетом требований вашего бизнеса. Вы также узнаете о перспективных тенденциях в сфере облачных сервисов и векторах развития облачных провайдеров.",
      "price": "560.00",
      "quantity": 7,
      "book_theme": "devops",
      "programming_language": "OT",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 4
    }
  },
  {
    "model": "catalogue.products",
    "pk": 69,
    "fields": {
      "name": "Гид по Computer Science, расширенное издание",
      "slug": "gid-po-computer-science-rasshirennoe-izdanie",
      "author": "Вильям Спрингер",
      "publisher": "Питер",
      "isbn": "978-5-4461-1825-0",
      "year": 2021,
      "number_of_pages": 304,
      "description": "Колосс на глиняных ногах - так можно назвать программиста без подготовки в области Computer Science. Уверенное владение основами позволяет \"не изобретать велосипеды\" и закладывать в архитектуру программ эффективные решения. Всё это избавляет от ошибок и чрезмерных затрат на тестирование и рефакторинг. Не беда, если вы чувствуете себя не у дел, когда другие программисты обсуждают аппроксимативный предел. Даже специалисты с опытом допускают ошибки из-за того, что подзабыли Computer Science. Расширенное издание бестселлера содержит все главные, а также продвинутые вопросы компьютерных наук: - типы и структуры данных; - алгоритмы; - графы; - теория сложности; - приемы эффективного решения задач; - безопасность; - железо и софт; - операционные системы; - сети; - базы данных и многое другое.",
      "price": "400.00",
      "quantity": 1,
      "book_theme": "CS",
      "programming_language": "OT",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 3
    }
  },
  {
    "model": "catalogue.products",
    "pk": 70,
    "fields": {
      "name": "Байесовская статистика. Star Wars, LEGO, резиновые уточки и многое другое",
      "slug": "bajesovskaya-statistika-star-wars-lego-rezinovye-utochki-i-mnogoe-drugoe",
      "author": "Уилл Курт",
      "publisher": "Питер",
      "isbn": "978-5-4461-1655-3",
      "year": 2021,
      "number_of_pages": 304,
      "description": "Нужно решить конкретную задачу, а перед вами куча непонятных данных, в которой черт ногу сломит? \"Байесовская статистика\" расскажет, как принимать правильные решения, задействуя свою интуицию и простую математику.\r\nПора забыть про заумные и занудные университетские лекции! Эта книга даст вам полное понимание байесовской статистики буквально \"на пальцах\" - с помощью простых объяснений и ярких примеров.\r\nЧтобы узнать, как применить байесовские подходы к реальной жизни, вы отправитесь на охоту за НЛО, поиграете в \"Лего\", рассчитаете вероятность выживания Хана Соло при полете через поле астероидов, а также узнаете, как оценить вероятность того, что вы не заболели (ковидом?!), несмотря на то, что нагуглили все симптомы родильной горячки.\r\nПрикладные задачи и упражнения помогут закрепить материал и заложить фундамент для работы с широким спектром задач: от невероятных текущих событий до ежедневных сюрпризов делового мира.\r\nВы научитесь:\r\n- Работать с распределениями и неопределенностями.\r\n- Сравнивать гипотезы и делать надежные выводы.\r\n- Использовать теорему Байеса.\r\n- Делать оценку апостериорной вероятности и проверять правильность собственных выводов.\r\nВсегда выбирайте лучшее!",
      "price": "421.00",
      "quantity": 2,
      "book_theme": "OT",
      "programming_language": "OT",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 3
    }
  },
  {
    "model": "catalogue.products",
    "pk": 71,
    "fields": {
      "name": "Программируй & типизируй",
      "slug": "programmiruj-tipiziruj",
      "author": "Влад Ришкуция",
      "publisher": "Питер",
      "isbn": "978-5-4461-1692-8",
      "year": 2021,
      "number_of_pages": 352,
      "description": "Причиной многих программных ошибок становится несоответствие типов данных. Сильная система типов позволяет избежать целого класса ошибок и обеспечить целостность данных в рамках всего приложения. Разработчик, научившись мастерски использовать типы в повседневной практике, будет создавать более качественный код, а также сэкономит время, которое потребовалось бы для выискивания каверзных ошибок, связанных с данными.\r\nВ книге рассказывается, как с помощью типизации создавать программное обеспечение, которое не только было бы безопасным и работало без сбоев, но также обеспечивало простоту в сопровождении.\r\nПримеры решения задач, написанные на TypeScript, помогут развить ваши навыки работы с типами, начиная от простых типов данных и заканчивая более сложными понятиями, такими как функторы и монады.",
      "price": "1001.00",
      "quantity": 1,
      "book_theme": "backend",
      "programming_language": "OT",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 3
    }
  },
  {
    "model": "catalogue.products",
    "pk": 72,
    "fields": {
      "name": "Java. Быстрый старт",
      "slug": "java-bystryj-start",
      "author": "Джейми Чан",
      "publisher": "Питер",
      "isbn": "978-5-4461-1801-4",
      "year": 2021,
      "number_of_pages": 272,
      "description": "Всегда хотели научиться программировать на Java, но не знаете, с чего начать? Или хотите быстро перейти с другого языка на Java?\r\nУже перепробовали множество книг и курсов, но ничего не подходит?\r\nСерия \"Быстрый старт\" - отличное решение, и вот почему: сложные понятия разбиты на простые шаги - вы сможете освоить язык Java, даже если никогда раньше не занимались программированием; все фундаментальные концепции подкреплены реальными примерами; вы получите полное представление о Java: концепции объектно-ориентированного программирования, средства обработки ошибок, работа с файлами, лямбда-выражения и т. д.; в конце книги вас ждет интересный проект, который поможет усвоить полученные знания.\r\nНу что, готовы? Погнали!",
      "price": "255.00",
      "quantity": 2,
      "book_theme": "OT",
      "programming_language": "Java",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 1
    }
  },
  {
    "model": "catalogue.products",
    "pk": 73,
    "fields": {
      "name": "Python. Быстрый старт",
      "slug": "python-bystryj-start",
      "author": "Джейми Чан",
      "publisher": "Питер",
      "isbn": "978-5-4461-1800-7",
      "year": 2021,
      "number_of_pages": 224,
      "description": "Всегда хотели научиться программировать на Python, но не знаете, с чего начать? Или хотите быстро перейти с другого языка на Python?\r\nУже перепробовали множество книг и курсов, но ничего не подходит?\r\nСерия «Быстрый старт» — отличное решение, и вот почему: сложные понятия разбиты на простые шаги — вы сможете освоить язык Python, даже если никогда раньше не занимались программированием; все фундаментальные концепции подкреплены реальными примерами; вы получите полное представление о Python: структуры управления, методы обработки ошибок, концепции объектно-ориентированного программирования и т. д.; в конце книги вас ждет интересный проект, который поможет усвоить полученные знания.\r\nНу что, готовы? Погнали!",
      "price": "255.00",
      "quantity": 3,
      "book_theme": "OT",
      "programming_language": "Python",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 1
    }
  },
  {
    "model": "catalogue.products",
    "pk": 74,
    "fields": {
      "name": "CSS для профи",
      "slug": "css-dlya-profi",
      "author": "Кит Грант",
      "publisher": "Питер",
      "isbn": "978-5-4461-0909-8",
      "year": 2021,
      "number_of_pages": 496,
      "description": "Как вы понимаете что зашли на хороший сайт? Это происходит практически мгновенно, с первого взгляда. Такие сайты привлекают внимание картинкой - отлично выглядят, - а кроме этого они интерактивны и отзывчивы. Сразу видно, что такую страничку создавал CSS-профи, ведь именно каскадные таблицы стилей (CSS) отвечают за всё наполнение и оформление сайта от расположения элементов до неуловимых штрихов. Дело за малым - стать CSS-профи, а для этого придется разобраться в принципах CSS, научиться воплощать в жизнь идеи дизайнеров, не забывать о таких важных \"мелочах\", как красиво подобранный шрифт, плавные переходы и сбалансированная графика.\r\nПеред вами прямой путь в высшую лигу веб-разработки. Книга \"CSS для профи\" подарит вам не только свежие идеи, но и вдохновит на подвиги, а облегчить этот тернистый путь помогут новейшие технические достижения - адаптивный дизайн, библиотеки шаблонов и многое другое.",
      "price": "489.00",
      "quantity": 9,
      "book_theme": "frontend",
      "programming_language": "OT",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 5
    }
  },
  {
    "model": "catalogue.products",
    "pk": 75,
    "fields": {
      "name": "Совершенный алгоритм. Алгоритмы для NP-трудных зада",
      "slug": "sovershennyj-algoritm-algoritmy-dlya-np-trudnyh-zada",
      "author": "Тим Рафгарден",
      "publisher": "Питер",
      "isbn": "978-5-4461-1799-4",
      "year": 2021,
      "number_of_pages": 304,
      "description": "Алгоритмы - это сердце и душа computer science. Без них не обойтись, они есть везде - от сетевой маршрутизации и расчетов по геномике до криптографии и машинного обучения. \"Совершенный алгоритм\" превратит вас в настоящего профи, который будет ставить задачи и мастерски их решать как в жизни, так и на собеседовании при приеме на работу в любую IT-компанию.\r\nЕсли вы уже достаточно прокачались в асимптотическом анализе, жадных алгоритмах и динамическом программировании, самое время рассмотреть понятие NP-трудности, которое часто вызывает неподдельный страх. Тим Рафгарден покажет, как распознать NP-трудную задачу, расскажет, как избежать решения с нуля, и поможет найти эффективные пути решения.\r\nТим Рафгарден - профессор Computer Science и Management Science and Engineering в Стэнфордском университете. Он изучает связи между информатикой и экономикой и занимается задачами разработки, анализа, приложений и ограничений алгоритмов. Среди его многочисленных наград - премии Калая (2016), Гёделя (2012) и Грейс Мюррей Хоппер (2009).",
      "price": "415.00",
      "quantity": 2,
      "book_theme": "CS",
      "programming_language": "OT",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 3
    }
  },
  {
    "model": "catalogue.products",
    "pk": 76,
    "fields": {
      "name": "Стильный Java. Код, который работает всегда и везде",
      "slug": "stilnyj-java-kod-kotoryj-rabotaet-vsegda-i-vezde",
      "author": "Марко Фаэлла",
      "publisher": "Питер",
      "isbn": "978-5-4461-1739-0",
      "year": 2021,
      "number_of_pages": 352,
      "description": "В современном мире разработки успешность приложения уже не определяется параметром \"просто работает\". Хороший программист должен знать возможности языка, практические приемы проектирования и платформенные средства для достижения максимальной производительности и жизнеспособности программ. Эта книга написана для разработчиков, которые хотят создавать качественный софт. Затронуты все ключевые показатели ПО: скорость, затраты памяти, надежность, удобочитаемость, потоковая безопасность, универсальность и элегантность. Реальные задачи и прикладные примеры кода на Java помогут надежно усвоить концепции.\r\nПройдя все этапы создания центрального проекта книги, вы сможете уверенно выбрать правильный путь оптимизации собственного приложения.",
      "price": "405.00",
      "quantity": 3,
      "book_theme": "OT",
      "programming_language": "Java",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 2
    }
  },
  {
    "model": "catalogue.products",
    "pk": 77,
    "fields": {
      "name": "Карьера программиста",
      "slug": "karera-programmista",
      "author": "Макдауэлл Лакман",
      "publisher": "Питер",
      "isbn": "9785446118397",
      "year": 2021,
      "number_of_pages": 688,
      "description": "Книга \"Карьера программиста\" основана на опыте практического участия автора во множестве собеседований, проводимых лучшими компаниями. Это квинтэссенция сотен интервью со множеством кандидатов, результат ответов на тысячи вопросов, задаваемых кандидатами и интервьюерами в ведущих мировых корпорациях. Из тысяч возможных задач и вопросов в книгу были отобраны 189 наиболее интересных и значимых.\r\nШестое издание этого мирового бестселлера поможет вам наилучшим образом подготовиться к собеседованию при приеме на работу программистом или руководителем в крупную IT-организацию или перспективный стартап. Основную часть книги составляют ответы на технические вопросы и задания, которые обычно получают соискатели на собеседовании в таких компаниях, как Google, Microsoft, Apple, Amazon и других. Рассмотрены типичные ошибки, которые допускают кандидаты, а также эффективные методики подготовки к собеседованию. Используя материал этой книги, вы с легкостью подготовитесь к устройству на работу в Google, Microsoft или любую другую ведущую IT-компанию.",
      "price": "512.00",
      "quantity": 6,
      "book_theme": "OT",
      "programming_language": "OT",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 4
    }
  },
  {
    "model": "catalogue.products",
    "pk": 78,
    "fields": {
      "name": "Swift. Основы разработки приложений под iOS, iPadOS и macOS",
      "slug": "swift-osnovy-razrabotki-prilozhenij-pod-ios-ipados-i-macos",
      "author": "Василий Усов",
      "publisher": "Питер",
      "isbn": "978-5-4461-1796-3",
      "year": 2021,
      "number_of_pages": 544,
      "description": "Мечтаете стать iOS-разработчиком, написать собственное приложение и работать в крутой компании? Тогда эта книга для вас!\r\nЯзык Swift прост, понятен и отлично подойдет как новичкам, так и опытным программистам. Чтобы начать писать код, вам потребуются только эта книга, компьютер и желание учиться. Все базовые концепции программирования и основы синтаксиса объясняются доступным языком, поэтому если вы никогда раньше не занимались разработкой, то эта книга — отличный старт. Теория чередуется с практическими примерами и кодом — так вы сразу сможете связать абстрактные понятия с реальными ситуациями. В каждой главе вас ждут тесты и домашние задания, которые помогут закрепить материал.\r\nА еще Swift — это дружелюбное сообщество в Telegram, где можно обсуждать проекты и получать поддержку.\r\nУчитесь, создавайте и творите свое будущее!",
      "price": "500.00",
      "quantity": 12,
      "book_theme": "backend",
      "programming_language": "OT",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 1
    }
  },
  {
    "model": "catalogue.products",
    "pk": 79,
    "fields": {
      "name": "Время UNIX. A History and a Memoir",
      "slug": "vremya-unix-a-history-and-a-memoir",
      "author": "Брайан Керниган",
      "publisher": "Питер",
      "isbn": "978-5-4461-1669-0",
      "year": 2021,
      "number_of_pages": 224,
      "description": "Операционная система Unix завоевала мир, чего совсем не могли представить ее создатели, творя историю на последнем этаже Bell Labs в 1969 году. Идея этой ОС оказала колоссальное влияние на разработку программного обеспечения и развитие операционных систем.\r\nВы узнаете о том, как зарождалась система Unix, чем она примечательна и почему занимает столь важное место в компьютерном мире, а также об удивительных людях, вложивших в нее силы и душу.\r\nКнига представляет собой честный и остроумный рассказ о жизни айтишного сообщества тех времен — никакой зауми, страниц кода и ссылок. Расслабьтесь и получайте удовольствие, погрузившись в историю, полную приключений и открытий.\r\nБрайан Керниган - автор и соавтор дюжины книг по программированию, включая легендарные \"Язык программирования Си\" и \"Unix. Программное окружение\". На протяжении 30 лет был членом той самой группы UNIX в исследовательском центре Bell Labs и не только наблюдал создание UNIX.",
      "price": "210.00",
      "quantity": 10,
      "book_theme": "OT",
      "programming_language": "OT",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 1
    }
  },
  {
    "model": "catalogue.products",
    "pk": 80,
    "fields": {
      "name": "Геймдизайн.Рецепты успеха лучших компьютерных игр от Super Mario и Doom до Assassin's Creed и дальше",
      "slug": "gamedesign",
      "author": "Сильвестр Тайнан",
      "publisher": "Питер",
      "isbn": "978-5-4461-1376-7",
      "year": 2024,
      "number_of_pages": 448,
      "description": "Что такое геймдизайн? Это не код, графика или звук. Это не создание персонажей или раскрашивание игрового поля. Геймдизайн - это симулятор мечты, набор правил, благодаря которым игра оживает.\r\n\r\nКак создать игру, которую полюбят, от которой не смогут оторваться? Знаменитый геймдизайнер Тайнан Сильвестр на примере кейсов из самых популярных игр рассказывает как объединить эмоции и впечатления, игровую механику и мотивацию игроков. Познакомитесь с принципами дизайна, которыми пользуются ведущие студии мира!\r\n\r\n- Создайте игровую механику, вызывающую эмоции и обеспечивающую разнообразие.\r\n- Узнайте как объединить сюжет и интерактивность.\r\n- Используйте взаимодействия, которые заставят игроков проникать друг другу \"в голову\"\r\n- Вовлекайте в действие с помощью наград\r\n- Планируйте, тестируйте и анализируйте геймдизайн последовательно, а не пытайтесь все решить заранее\r\n- Узнайте, как позиционирование игры на рынке влияет на геймдизайн",
      "price": "400.00",
      "quantity": 3,
      "book_theme": "gamedev",
      "programming_language": "OT",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 1
    }
  },
  {
    "model": "catalogue.products",
    "pk": 81,
    "fields": {
      "name": "Паттерны объектно-ориентированного проектирования",
      "slug": "patterny-obektno-orientirovannogo-proektirovaniya",
      "author": "Гамма, Хелм, Джонсон",
      "publisher": "Питер",
      "isbn": "978-5-4461-1595-2",
      "year": 2021,
      "number_of_pages": 448,
      "description": "Больше 25 лет прошло с момента выхода первого тиража книги Design Patterns. За это время книга из популярной превратилась в культовую. Во всем мире ее рекомендуют прочитать каждому, кто хочет связать жизнь с информационными технологиями и программированием. \"Русский\" язык, на котором разговаривают айтишники поменялся, многие англоязычные термины стали привычными, паттерны вошли в нашу жизнь. Перед вами юбилейное издание с обновленным переводом книги, ставшей must-read для каждого программиста. \"Паттерны объектно-ориентированного проектирования\" пришли на смену \"Приемам объектно-ориентированного проектирования\".\r\nЧетыре первоклассных разработчика - Банда четырех - представляют вашему вниманию опыт ООП в виде двадцати трех паттернов. Паттерны появились потому, что разработчики искали пути повышения гибкости и степени повторного использования своих программ. Авторы не только дают принципы использования шаблонов проектирования, но и систематизируют информацию. Вы узнаете о роли паттернов в архитектуре сложных систем и сможете быстро и эффективно создавать собственные приложения с учетом всех ограничений, возникающих при разработке больших проектов. Все шаблоны взяты из реальных систем и основаны на реальной практике. Для каждого паттерна приведен код на C ++ или Smalltalk, демонстрирующий его возможности.",
      "price": "405.00",
      "quantity": 2,
      "book_theme": "CS",
      "programming_language": "OT",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 3
    }
  },
  {
    "model": "catalogue.products",
    "pk": 82,
    "fields": {
      "name": "Машинное обучение на R: экспертные техники для прогностического анализа",
      "slug": "mashinnoe-obuchenie-na-r-ekspertnye-tehniki-dlya-prognosticheskogo-analiza",
      "author": "Бретт Ланц",
      "publisher": "Питер",
      "isbn": "978-5-4461-1512-9",
      "year": 2020,
      "number_of_pages": 464,
      "description": "Язык R предлагает мощный набор методов машинного обучения, позволяющих быстро проводить нетривиальный анализ ваших данных.\r\nКнига является руководством, которое поможет применять методы машинного обучения в решении ежедневных задач. Бретт Ланц научит всему необходимому для анализа данных, формирования прогнозов и визуализации данных.\r\nЗдесь вы найдете информацию о новых улучшенных библиотеках, советы об этических аспектах машинного обучения и проблемах предвзятости, а также познакомитесь с глубоким обучением.\r\nВ этой книге\r\n- Основы машинного обучения и особенности обучения компьютера на примерах.\r\n- Подготовка данных к использованию в машинном обучении средствами языка R.\r\n- Классификация значимости результатов.\r\n- Предсказание событий с помощью деревьев решений, правил и опорных векторов.\r\n- Прогнозирование числовых данных и оценка финансовых данных с помощью регрессионных методов.\r\n- Моделирование сложных процессов с использованием нейронных сетей – фундамент глубокого обучения.\r\n- Оценка моделей и улучшение их производительности.\r\n- Новейшие технологии для обработки больших данных, в частности R 3.6, Spark, H2O и TensorFlow.",
      "price": "610.00",
      "quantity": 2,
      "book_theme": "ai",
      "programming_language": "OT",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 5
    }
  },
  {
    "model": "catalogue.products",
    "pk": 83,
    "fields": {
      "name": "Глубокое обучение. Погружение в мир нейронных сетей",
      "slug": "glubokoe-obuchenie-pogruzhenie-v-mir-nejronnyh-setej",
      "author": "Николенко, Кадурин, Архангельская",
      "publisher": "Питер",
      "isbn": "978-5-4461-1537-2",
      "year": 2020,
      "number_of_pages": 480,
      "description": "Перед вами - первая книга о глубоком обучении, написанная на русском языке. Глубокие модели оказались ключом, который подходит ко всем замкам сразу: новые архитектуры и алгоритмы обучения, а также увеличившиеся вычислительные мощности и появившиеся огромные наборы данных, привели к революционным прорывам в компьютерном зрении, распознавании речи, обработке естественного языка и многих других типично \"человеческих\" задачах машинного обучения. Эти захватывающие идеи, вся история и основные компоненты революции глубокого обучения, а также самые современные достижения этой области, доступно и интересно изложены в книге. Максимум объяснений, минимум кода, серьезный материал о машинном обучении и увлекательное изложение - в этой уникальной работе замечательных российских ученых и интеллектуалов.",
      "price": "720.00",
      "quantity": 1,
      "book_theme": "data",
      "programming_language": "OT",
      "book_bindings": "Твердый переплет",
      "translator_choice": "Отсутствует",
      "level": 1
    }
  },
  {
    "model": "catalogue.products",
    "pk": 84,
    "fields": {
      "name": "Разработка с использованием квантовых компьютеров",
      "slug": "razrabotka-s-ispolzovaniem-kvantovyh-kompyuterov",
      "author": "Владимир Силва",
      "publisher": "Питер",
      "isbn": "978-5-4461-1429-0",
      "year": 2020,
      "number_of_pages": 352,
      "description": "Квантовые вычисления не просто меняют реальность! Совершенно новая отрасль рождается на наших глазах, чтобы создать немыслимое ранее и обесценить некоторые достижения прошлого.\r\nВ этой книге рассмотрены наиболее важные компоненты квантового компьютера: кубиты, логические вентили и квантовые схемы, а также объясняется отличие квантовой архитектуры от традиционной. Вы сможете бесплатно экспериментировать с ними как в симуляторе, так и на реальном квантовом устройстве с применением IBM Q Experience.\r\nВы узнаете, как выполняются квантовые вычисления с помощью QISKit (программный инструментарий для обработки квантовой информации), Python SDK и других API, в частности QASM.\r\nНаконец, вы изучите современные квантовые алгоритмы, реализующие запутанность, генерацию случайных чисел, линейный поиск, факторизацию целых чисел и др. Разберетесь с состояниями Белла, описывающими запутанность, алгоритмом Гровера для линейного поиска, алгоритмом Шора для факторизации целых чисел, алгоритмами оптимизации и многим другим.\r\nВы научитесь:\r\n- Удаленно запускать программы, пользуясь Q Experience REST API.\r\n- Писать алгоритмы, обеспечивающие высочайшую производительность по сравнению с аналогами для традиционных компьютеров.\r\n- Создавать REST-клиент на Node.js для аутентификации, прослушивания удаленных устройств, запроса информации о квантовых процессорах, удаленного контроля и запуска экспериментов в облаке.\r\n- Использовать квантовую телепортацию. Воспользовавшись классическими вычислениями и квантовой запутанностью между отправителем и получателем, передавать точное состояние кубита (квантовой информации).\r\n- Программировать и играть в квантовый вариант \"Морского боя\".\r\n- Использовать Q Experience Composer для создания визуальных программ/экспериментов.",
      "price": "435.00",
      "quantity": 4,
      "book_theme": "OT",
      "programming_language": "OT",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 4
    }
  },
  {
    "model": "catalogue.products",
    "pk": 85,
    "fields": {
      "name": "Архитекторы интеллекта. Вся правда об искусственном интеллекте от его создателей",
      "slug": "arhitektory-intellekta-vsya-pravda-ob-iskusstvennom-intellekte-ot-ego-sozdatelej",
      "author": "Мартин Форд",
      "publisher": "Питер",
      "isbn": "978-5-4461-1254-8",
      "year": 2020,
      "number_of_pages": 416,
      "description": "Искусственный интеллект (ИИ) быстро переходит из области научной фантастики в повседневную жизнь. Современные устройства распознают человеческую речь, способны отвечать на вопросы и выполнять машинный перевод. В самых разных областях, от управления беспилотным автомобилем до диагностирования рака, применяются алгоритмы распознавания объектов на базе ИИ, возможности которых превосходят человеческие. Крупные медиакомпании используют роботизированную журналистику, создающую из собранных данных статьи, подобные авторским. Очевидно, что ИИ готов стать по-настоящему универсальной технологией, такой как электричество.\r\nКакие подходы и технологии считаются наиболее перспективными? Какие крупные открытия возможны в ближайшие годы? Можно ли создать по-настоящему мыслящую машину или ИИ, сравнимый с человеческим, и как скоро? Какие риски и угрозы связаны с ИИ, и как их избежать? Вызовет ли ИИ хаос в экономике и на рынке труда? Смогут ли суперинтеллектуальные машины выйти из-под контроля человека и превратиться в реальную угрозу?\r\nРазумеется, предсказать будущее невозможно. Тем не менее, эксперты знают о текущем состоянии технологий, а также об инновациях ближайшего будущего больше, чем кто бы то ни было. Вас ждут блестящие встречи с такими признанными людьми, как Р. Курцвейл, Д. Хаббабис, Дж. Хинтон, Р. Брукс и многими другими.\r\nПодробнее: https://www.labirint.ru/books/725660/",
      "price": "280.00",
      "quantity": 2,
      "book_theme": "ai",
      "programming_language": "OT",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 1
    }
  },
  {
    "model": "catalogue.products",
    "pk": 86,
    "fields": {
      "name": "Java для всех",
      "slug": "java-dlya-vseh",
      "author": "Алексей Васильев",
      "publisher": "Питер",
      "isbn": "978-5-4461-1382-8",
      "year": 2020,
      "number_of_pages": 512,
      "description": "Java - один из самых популярных и востребованных языков в мире. Алексей Васильев - автор многочисленных компьютерных бестселлеров - познакомит вас со всем необходимым для эффективной работы с этим языком. Вы изучите базовые типы, управляющие инструкции, особенности описания классов и объектов в Java, создание интерфейсов, лямбда-выражения, обобщенные классы. Каждая глава содержит примеры кода, которые в свою очередь снабжены как построчными пояснениями, так и подробным разбором примера программы.\r\nПримеры, используемые в этой книге, пригодятся вам в дальнейшей работе с языком Java. Программирование - это не страшно! Даже если у вас нет никакого опыта, вы с легкостью освоите Java, воспользовавшись уникальной методикой Алексея Васильева, и перейдете на профессиональный уровень.",
      "price": "630.00",
      "quantity": 0,
      "book_theme": "OT",
      "programming_language": "Java",
      "book_bindings": "Твердый переплет",
      "translator_choice": "Отсутствует",
      "level": 1
    }
  },
  {
    "model": "catalogue.products",
    "pk": 87,
    "fields": {
      "name": "Экстремальное программирование. Разработка через тестирование",
      "slug": "ekstremalnoe-programmirovanie-razrabotka-cherez-testirovanie",
      "author": "Кент Бек",
      "publisher": "Питер",
      "isbn": "978-5-4461-1439-9",
      "year": 2022,
      "number_of_pages": 224,
      "description": "Возвращение знаменитого бестселлера. Изящный, гибкий и понятный код, который легко модифицировать, который корректно работает и который не подкидывает своим создателям неприятных сюрпризов. Неужели подобное возможно? Чтобы достичь цели, попробуйте тестировать программу еще до того, как она написана. Именно такая парадоксальная идея положена в основу методики TDD (Test-Driven-Development - разработка, основанная на тестировании). Бессмыслица? Не спешите делать скороспелые выводы. Рассматривая применение TDD на примере разработки реального программного кода, автор демонстрирует простоту и мощь этой методики. В книге приведены два программных проекта, целиком и полностью реализованных с использованием TDD. За рассмотрением примеров следует обширный каталог приемов работы в стиле TDD, а также паттернов и рефакторингов, имеющих отношение к TDD. Книга будет полезна для любого программиста, желающего повысить производительность своей работы и получить удовольствие от программирования.",
      "price": "313.00",
      "quantity": 3,
      "book_theme": "OT",
      "programming_language": "OT",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 5
    }
  },
  {
    "model": "catalogue.products",
    "pk": 88,
    "fields": {
      "name": "Микросервисы. Паттерны разработки и рефакторинга",
      "slug": "mikroservisy-patterny-razrabotki-i-refaktoringa",
      "author": "Крис Ричардсон",
      "publisher": "Питер",
      "isbn": "978-5-4461-0996-8",
      "year": 2022,
      "number_of_pages": 544,
      "description": "Если вам давно кажется, что вся разработка и развертывание в вашей компании донельзя замедлились - переходите на микросервисную архитектуру. Она обеспечивает непрерывную разработку, доставку и развертывание приложений любой сложности.\r\nКнига, предназначенная для разработчиков и архитекторов из больших корпораций, рассказывает, как проектировать и писать приложения в духе микросервисной архитектуры. Также в ней описано, как делается рефакторинг крупного приложения - и монолит превращается в набор микросервисов.\r\nВ этой книге:\r\n-Как (и зачем!) использовать микросервисную архитектуру.\r\n-Стратегии декомпозиции сервисов.\r\n-Управление транзакциями и шаблоны запросов.\r\n-Эффективные стратегии тестирования.\r\n-Шаблоны развертывания, включая контейнеры и бессерверные платформы",
      "price": "470.00",
      "quantity": 6,
      "book_theme": "backend",
      "programming_language": "OT",
      "book_bindings": "Твердый переплет",
      "translator_choice": "Имя переводчика",
      "level": 4
    }
  },
  {
    "model": "catalogue.products",
    "pk": 89,
    "fields": {
      "name": "Linux в действии",
      "slug": "linux-v-dejstvii",
      "author": "Дэвид Клинтон",
      "publisher": "Питер",
      "isbn": "978-5-4461-1199-2",
      "year": 2019,
      "number_of_pages": 416,
      "description": "Без практики ничему нельзя научиться, и Linux не исключение. Книга \"Linux в действии\" поможет приобрести навыки защиты файлов, папок и серверов, безопасной установки патчей и приложений, а также управления сетью.\r\nВ книге описываются 12 реальных проектов, в том числе автоматизация системы резервного копирования и восстановления, настройка личного файлового облака в стиле Dropbox и создание собственного сервера MediaWiki. На интересных примерах вы изучите виртуализацию, аварийное восстановление, обеспечение безопасности, резервное копирование, внедрение DevOps и устранение неполадок системы. Каждая глава заканчивается обзором практических рекомендаций, глоссарием новых терминов и упражнениями.",
      "price": "346.00",
      "quantity": 0,
      "book_theme": "devops",
      "programming_language": "OT",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 3
    }
  },
  {
    "model": "catalogue.products",
    "pk": 90,
    "fields": {
      "name": "Vue.js в действии",
      "slug": "vuejs-v-dejstvii",
      "author": "Хэнчетт, Листоун",
      "publisher": "Питер",
      "isbn": "978-5-4461-1098-8",
      "year": 2019,
      "number_of_pages": 304,
      "description": "Vue.js - это популярная библиотека для создания пользовательских интерфейсов. В ней значительно переосмыслены реактивные идеи, впервые появившиеся в React.js.\r\nКнига \"Vue.js в действии\" рассказывает о создании быстрых и эластичных пользовательских интерфейсов для Интернета. Освоив ее, вы напишете полноценное приложение для интернет-магазина, где будут присутствовать списки товаров, админка, а также организован полноценный процесс онлайнового заказа.",
      "price": "290.00",
      "quantity": 2,
      "book_theme": "frontend",
      "programming_language": "OT",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 3
    }
  },
  {
    "model": "catalogue.products",
    "pk": 91,
    "fields": {
      "name": "Приемы объектно-ориентированного проектирования. Паттерны проектирования",
      "slug": "priemy-obektno-orientirovannogo-proektirovaniya-patterny-proektirovaniya",
      "author": "Гамма, Хелм, Джонсон",
      "publisher": "Питер",
      "isbn": "978-5-4461-1213-5",
      "year": 2019,
      "number_of_pages": 368,
      "description": "В предлагаемой книге описываются простые и изящные решения типичных задач, возникающих в объектно-ориентированном проектировании. Паттерны появились потому, что многие разработчики искали пути повышения гибкости и степени повторного использования своих программ. Найденные решения воплощены в краткой и легко применимой на практике форме. Авторы излагают принципы использования паттернов проектирования и приводят их каталог. Таким образом, книга одновременно решает две задачи. Во-первых, здесь демонстрируется роль паттернов в создании архитектуры сложных систем. Во-вторых, применяя содержащиеся в справочнике паттерны, проектировщик сможет с легкостью разрабатывать собственные приложения.\r\nИздание предназначено как для профессиональных разработчиков, так и для программистов, осваивающих объектно-ориентированное проектирование.",
      "price": "250.00",
      "quantity": 3,
      "book_theme": "OT",
      "programming_language": "OT",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 2
    }
  },
  {
    "model": "catalogue.products",
    "pk": 92,
    "fields": {
      "name": "Spring. Все паттерны проектирования",
      "slug": "spring-vse-patterny-proektirovaniya",
      "author": "Динеш Раджпут",
      "publisher": "Питер",
      "isbn": "978-5-4461-0935-7",
      "year": 2019,
      "number_of_pages": 320,
      "description": "В этой книге дается обзор фреймворка Spring 5 и паттернов проектирования для него. Объясняется принцип внедрения зависимостей (dependency injection), играющий ключевую роль при создании слабосвязанного кода во фреймворке Spring. Затем рассматриваются классические паттерны \"Банды четырех\" при проектировании приложений на Spring. В следующих частях книги автор рассматривает паттерны аспектно-ориентированного программирования (AOP), шаблоны JDBC, позволяющие абстрагировать доступ к базе данных. В заключительных главах книги автор исследует работу с MVC, реактивные шаблоны проектирования и паттерны проектирования, применяемые при конкурентном и параллельном программировании в Spring.",
      "price": "405.00",
      "quantity": 3,
      "book_theme": "OT",
      "programming_language": "Java",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 3
    }
  },
  {
    "model": "catalogue.products",
    "pk": 93,
    "fields": {
      "name": "Git для профессионального программиста",
      "slug": "git-dlya-professionalnogo-programmista",
      "author": "Чакон, Страуб",
      "publisher": "Питер",
      "isbn": "978-5-4461-1131-2",
      "year": 2019,
      "number_of_pages": 496,
      "description": "Эта книга представляет собой обновленное руководство по использованию Git в современных условиях. С тех пор как проект Git - распределенная система управления версиями - был создан Линусом Торвальдсом, прошло много лет, и система Git превратилась в доминирующую систему контроля версий, как для коммерческих целей, так и для проектов с открытым исходным кодом. Эффективный и хорошо реализованный контроль версий необходим для любого успешного веб-проекта. Постепенно эту систему приняли на вооружение практически все сообщества разработчиков ПО с открытым исходным кодом. Появление огромного числа графических интерфейсов для всех платформ и поддержка IDE позволили внедрить Git в операционные системы семейства Windows. Второе издание книги было обновлено для Git-версии 2.0 и уделяет большое внимание GitHub.",
      "price": "560.00",
      "quantity": 0,
      "book_theme": "OT",
      "programming_language": "OT",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 3
    }
  },
  {
    "model": "catalogue.products",
    "pk": 94,
    "fields": {
      "name": "Теоретический минимум по Big Data. Всё что нужно знать о больших данных",
      "slug": "teoreticheskij-minimum-po-big-data-vsyo-chto-nuzhno-znat-o-bolshih-dannyh",
      "author": "Ын, Су",
      "publisher": "Питер",
      "isbn": "978-5-4461-1040-7",
      "year": 2019,
      "number_of_pages": 208,
      "description": "Сегодня Big Data - это большой бизнес. Нашей жизнью управляет информация, и извлечение выгоды из нее становится центральным моментом в работе современных организаций. Не важно кто вы - деловой человек, работающий с аналитикой, начинающий программист или разработчик, - \"Теоретический минимум по Big Data\" позволит разобраться в основах новой и стремительно развивающейся отрасли обработки больших данных.\r\nХотите узнать о больших данных и механизмах работы с ними? Каждому алгоритму посвящена отдельная глава, в которой не только объясняются основные принципы работы, но и даются примеры использования в реальных задачах. Большое количество иллюстраций и простые комментарии позволят легко разобраться в самых сложных аспектах Big Data.\r\n\"Отличная визуализация концепций машинного обучения позволяет \"нетехнарям\" интуитивно понять сложные абстрактные понятия. Это лаконичная и точная выжимка содержит теоретический минимум информации, необходимый для первого знакомства с Big Data.\"\r\nЭтан Чен, автор курса CS 102: Big Data, Стэнфордский университет",
      "price": "300.00",
      "quantity": 10,
      "book_theme": "data",
      "programming_language": "OT",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 1
    }
  },
  {
    "model": "catalogue.products",
    "pk": 95,
    "fields": {
      "name": "Data Science. Инсайдерская информация для новичков. Включая язык R",
      "slug": "data-science-insajderskaya-informaciya-dlya-novichkov-vklyuchaya-yazyk-r",
      "author": "О`Нил, Шатт",
      "publisher": "Питер",
      "isbn": "978-5-4461-0622-6",
      "year": 2019,
      "number_of_pages": 368,
      "description": "Data Science (исследование данных) - одна из самых востребованных специализаций нашего времени. Изучение данных позволяет преобразить любую традиционную или инновационную бизнес-модель. Эта книга основана на вводном курсе по Data Science из Колумбийского университета, и начинающему специалисту-аналитику она совершенно необходима.\r\nЭта книга увлекательно и доступно рассказывает о:\r\n- Байесовском методе;\r\n- Статистических алгоритмах;\r\n- Финансовом моделировании;\r\n- Рекомендательных движках;\r\n- Визуализации данных;\r\n- MapReduce.\r\nС примерами на языках Python и R.",
      "price": "410.00",
      "quantity": 0,
      "book_theme": "data",
      "programming_language": "Python",
      "book_bindings": "Твердый переплет",
      "translator_choice": "Имя переводчика",
      "level": 1
    }
  },
  {
    "model": "catalogue.products",
    "pk": 96,
    "fields": {
      "name": "Грокаем алгоритмы. Иллюстрированное пособие для программистов и любопытствующих",
      "slug": "grokaem-algoritmy-illyustrirovannoe-posobie-dlya-programmistov-i-lyubopytstvuyushih",
      "author": "Адитья Бхаргава",
      "publisher": "Питер",
      "isbn": "978-5-4461-0923-4",
      "year": 2022,
      "number_of_pages": 288,
      "description": "Алгоритмы - это всего лишь пошаговые алгоритмы решения задач, и большинство таких задач уже были кем-то решены, протестированы и проверены. Можно, конечно, погрузится в глубокую философию гениального Кнута, изучить многостраничные фолианты с доказательствами и обоснованиями, но хотите ли вы тратить на это свое время? Откройте великолепно иллюстрированную книгу и вы сразу поймете, что алгоритмы - это просто. А грокать алгоритмы - это веселое и увлекательное занятие.",
      "price": "310.00",
      "quantity": 10,
      "book_theme": "CS",
      "programming_language": "OT",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 1
    }
  },
  {
    "model": "catalogue.products",
    "pk": 97,
    "fields": {
      "name": "C# 7 и .NET Core. Кросс-платформенная разработка для профессионалов",
      "slug": "c-7-i-net-core-kross-platformennaya-razrabotka-dlya-professionalov",
      "author": "Марк Прайс",
      "publisher": "Питер",
      "isbn": "978-5-4461-0516-8",
      "year": 2018,
      "number_of_pages": 640,
      "description": "C# 7 - новая мощная и многофункциональная версия популярнейшего языка программирования от Майкрософт. Вы встретите немало интересных книг по языку C# и платформе .NET, однако, в большинстве из них лишь мельком рассматривается столь важный аспект, как кросс-платформенная разработка. Научитесь писать приложения, которые работают всегда и везде, на ПК и мобильных устройствах. Познакомьтесь с инструментом Xamarin.Forms, освойте тонкости работы с Visual Studio 2017, добейтесь многогранности и универсальности ваших программ на C#.",
      "price": "1599.00",
      "quantity": 1,
      "book_theme": "OT",
      "programming_language": "C#",
      "book_bindings": "Твердый переплет",
      "translator_choice": "Имя переводчика",
      "level": 1
    }
  },
  {
    "model": "catalogue.products",
    "pk": 98,
    "fields": {
      "name": "Теоретический минимум по Computer Science. Все что нужно программисту и разработчику Подробнее: https://www.labirint.ru/books/641481/",
      "slug": "teoreticheskij-minimum-po-computer-science-vse-chto-nuzhno-programmistu-i-razrabotchiku-podrobnee-httpswwwlabirintrubooks641481",
      "author": "Фило Феррейра",
      "publisher": "Питер",
      "isbn": "978-5-4461-0587-8",
      "year": 2021,
      "number_of_pages": 224,
      "description": "Хватит тратить время на скучные академические фолианты! Изучение Computer Science может быть веселым и увлекательным занятием.\r\nВладстон Феррейра Фило знакомит нас с вычислительным мышлением, позволяющим решать любые сложные задачи. Научиться писать код просто - пара недель на курсах, и вы \"программист\", но чтобы стать профи, который будет востребован всегда и везде, нужны фундаментальные знания. Здесь вы найдете только самую важную информацию, которая необходима каждому разработчику и программисту каждый день.\r\n\"Эта книга пригодится и для решения повседневных задач. Упреждающая выборка и кэширование помогут сложить рюкзак, параллелизм облегчит готовку на кухне.\r\nНу и, разумеется, ваш программный код будет просто потрясающим\".\r\nВладстон Феррейра Фило",
      "price": "340.00",
      "quantity": 0,
      "book_theme": "CS",
      "programming_language": "OT",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 1
    }
  },
  {
    "model": "catalogue.products",
    "pk": 99,
    "fields": {
      "name": "Ruby. Объектно-ориентированное проектирование",
      "slug": "ruby-obektno-orientirovannoe-proektirovanie",
      "author": "Сэнди Метц",
      "publisher": "Питер",
      "isbn": "978-5-4461-0875-6",
      "year": 2018,
      "number_of_pages": 304,
      "description": "Мировой бестселлер по программированию на языке Ruby. Книга уже стала классической - с ювелирной точностью она описывает огранку профессионального кода на Ruby. Внимательно изучив это незаменимое руководство, вы сможете:\r\n- Понять, как писать на Ruby качественный код в духе ООП\r\n- Решать, что должно входить в состав класса Ruby\r\n- Не допускать тесной связи между объектами в тех случаях, когда требуется разграничить функциональность\r\n- Определять гибкие интерфейсы между объектами\r\n- Освоить утиную типизацию\r\n- Эффективно задействовать наследование, композицию и полиморфизм\r\n- Разрабатывать экономные тесты\r\n- Доводить до совершенства любой legacy-код Ruby.",
      "price": "999.00",
      "quantity": 0,
      "book_theme": "backend",
      "programming_language": "OT",
      "book_bindings": "Твердый переплет",
      "translator_choice": "Имя переводчика",
      "level": 5
    }
  },
  {
    "model": "catalogue.products",
    "pk": 100,
    "fields": {
      "name": "Основы Data Science и Big Data. Python и наука о данных Подробнее: https://www.labirint.ru/books/568285/",
      "slug": "osnovy-data-science-i-big-data-python-i-nauka-o-dannyh-podrobnee-httpswwwlabirintrubooks568285",
      "author": "Силен, Мейсман, Мохамед",
      "publisher": "Питер",
      "isbn": "978-5-4461-0944-9",
      "year": 2018,
      "number_of_pages": 336,
      "description": "Data Science - это совокупность понятий и методов, позволяющих придать смысл и понятный вид огромным объемам данных.\r\nКаждая из глав этой книги посвящена одному из самых интересных аспектов анализа и обработки данных. Вы начнете с теоретических основ, затем перейдете к алгоритмам машинного обучения, работе с огромными массивами данных, NoSQL, потоковым данным, глубокому анализу текстов и визуализации информации. В многочисленных практических примерах использованы сценарии Python.\r\nОбработка и анализ данных - одна из самых горячих областей IT, где постоянно требуются разработчики, которым по плечу проекты любого уровня, от социальных сетей до обучаемых систем. Надеемся, книга станет отправной точкой для вашего путешествия в увлекательный мир Data Science.",
      "price": "405.00",
      "quantity": 2,
      "book_theme": "data",
      "programming_language": "OT",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 1
    }
  },
  {
    "model": "catalogue.products",
    "pk": 101,
    "fields": {
      "name": "Java для начинающих. Объектно-ориентированный подход",
      "slug": "java-dlya-nachinayushih-obektno-orientirovannyj-podhod",
      "author": "Бэзинс, Бэкил, Ванден",
      "publisher": "Питер",
      "isbn": "978-5-496-02402-0",
      "year": 2018,
      "number_of_pages": 688,
      "description": "Книга \"Java для начинающих. Объектно-ориентированный подход\" - доступный ресурс для знакомства с одним из самых долговечных и стабильно популярных языков программирования в мире. Книга основана на учебном курсе, который преподают авторы; она начинается с основ и постепенно рассматривает все более сложные концепции. В книге вы научитесь работать с интегрированной средой разработки, позволяющей читателю сразу же применять усвоенные знания. Каждая глава основана на примерах из реальной практики и учебных сценариях, а в заключительных главах приведены кейсы, на которых читатель может опробовать изученный материал и скомбинировать несколько концепций.",
      "price": "875.00",
      "quantity": 5,
      "book_theme": "OT",
      "programming_language": "Java",
      "book_bindings": "Твердый переплет",
      "translator_choice": "Имя переводчика",
      "level": 1
    }
  },
  {
    "model": "catalogue.products",
    "pk": 102,
    "fields": {
      "name": "Стек MEAN. Mongo, Express, Angular, Node",
      "slug": "stek-mean-mongo-express-angular-node",
      "author": "Саймон Холмс",
      "publisher": "Питер",
      "isbn": "978-5-496-02459-4",
      "year": 2017,
      "number_of_pages": 496,
      "description": "Обычно при веб-разработке на всех уровнях стека используются разные языки программирования. База данных MongoDB, фреймворки Express и AngularJS и технология Node.js вместе образуют стек MEAN - мощную платформу, на всех уровнях которой применяется всего один язык: JavaScript. Стек MEAN привлекателен для разработчиков и бизнеса благодаря простоте и экономичности, а конечные пользователи любят MEAN-приложения за их скорость и отзывчивость.",
      "price": "550.00",
      "quantity": 4,
      "book_theme": "devops",
      "programming_language": "OT",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 4
    }
  },
  {
    "model": "catalogue.products",
    "pk": 103,
    "fields": {
      "name": "HTML5 и CSS3. Разработка сайтов для любых браузеров и устройств",
      "slug": "html5-i-css3-razrabotka-sajtov-dlya-lyubyh-brauzerov-i-ustrojstv",
      "author": "Бен Фрэйн",
      "publisher": "Питер",
      "isbn": "978-5-496-02271-2",
      "year": 2017,
      "number_of_pages": 272,
      "description": "Сегодня как никогда остро стоит проблема адаптивного веб-дизайна. Все больше планшетных компьютеров, смартфонов и даже телевизоров используется для выхода в Интернет. Разработчикам веб-страниц требуется принимать во внимание огромное разнообразие размеров экранов, а также учитывать особенности соответствующего пользовательского взаимодействия. Адаптивный веб-дизайн позволяет наилучшим образом отобразить содержимое сайтов на экранах устройств, используемых для просмотра. При этом веб-страницы будут хорошо смотреться на дисплеях не только современных устройств, но и тех, что появятся в ближайшее время.\r\nНачните разрабатывать сайты в соответствии с новой методологией адаптивного веб-дизайна, благодаря чему они будут красиво отображаться на экранах любых размеров. Читайте эту книгу, попутно создавая и улучшая адаптивные веб-дизайны с использованием HTML5 и CSS3. Вы научитесь применять на практике новые технологии и методики, призванные стать инструментами будущего для веб-разработчиков клиентских приложений.",
      "price": "325.00",
      "quantity": 3,
      "book_theme": "frontend",
      "programming_language": "OT",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 3
    }
  },
  {
    "model": "catalogue.products",
    "pk": 104,
    "fields": {
      "name": "Android для разработчиков",
      "slug": "android-dlya-razrabotchikov",
      "author": "Дейтел, Дейтел, Уолд",
      "publisher": "Питер",
      "isbn": "978-5-496-02371-9",
      "year": 2016,
      "number_of_pages": 512,
      "description": "Добро пожаловать в динамичный мир разработки приложений для смартфонов и планшетов Android с использованием Android Software Development Kit (SDK), языка программирования Javа, а также новой и стремительно развивающейся среды разработки Android Studio. В основе книги лежит принцип разработки, ориентированной на приложения, - концепции показаны на примере полностью работоспособных приложений Android, а не фрагментов кода.\r\nБолее миллиона человек уже воспользовались книгами Дейтелов, чтобы освоить Java, C#, C++, C, JavaScript, XML, Visual Basic, Visual C++, Perl, Python и другие языки программирования. Третье издание этой книги позволит вам не только приступить к разработке приложений для Android , но и быстро опубликовать их в Google Play. Третье издание книги было полностью обновлено и познакомит вас с возможностями Android 6 и Android Studio.",
      "price": "630.00",
      "quantity": 2,
      "book_theme": "OT",
      "programming_language": "OT",
      "book_bindings": "Мягкий переплет",
      "translator_choice": "Имя переводчика",
      "level": 3
    }
  }
]
